{
  "data": [
    {
      "title": "Understanding Dietary Supplements",
      "link": "https://www.fda.gov/media/158337/download?attachment",
      "source": "FDA",
      "accessed_at": "05/05/2025",
      "content": "Understanding Dietary Supplements Dietary supplements can be beneficial to your health, but they can also involve health risks. Before deciding whether to take a supplement, it is important to know the facts. What are Dietary Supplements? Dietary supplements are products that are ingested and are intended to add to or “supplement” the diet. Supplements can come in a variety of forms, including tablets, capsules, softgels, gel caps, liquids, gummies, powders, and bars. Common dietary supplements include: • Vitamins (such as multivitamins or individual vitamins like vitamin D and biotin) • Minerals (such as calcium, magnesium, and iron) • Botanicals or herbs (such as echinacea and ginger) • Botanical compounds (such as caffeine and curcumin) • Amino acids (such as tryptophan and glutamine) • Live microbials (commonly referred to as “probiotics”) How are Dietary Supplements Regulated? Under the Dietary Supplement Health and Education Act (DSHEA), companies are responsible for ensuring that the dietary supplements they sell are safe and properly labeled. Unlike drugs, FDA does not have the authority to approve dietary supplements or their labeling before they are sold to the public. In fact, companies can often introduce a dietary supplement to the market without notifying FDA. FDA’s role in regulating dietary supplements primarily begins after products enter the marketplace. If a product is found to be unsafe or not otherwise in compliance with the law, FDA can work with the company to bring the product into compliance or possibly remove it from the market. How are Dietary Supplements Labeled? Dietary Supplements are required to have a Supplement Facts label that lists the serving size, the number of servings per container, each dietary ingredient in the product, and the amount of certain ingredients per serving. They are also required to have a statement on the front of the product identifying it as a “dietary supplement” or similar term (for example, “vitamin supplement”). What are the Benefits of Dietary Supplements? Dietary supplements can help you improve or maintain your overall health, and some supplements can also help you meet your daily requirements of essential nutrients. For example, calcium and vitamin D can help build strong bones. Even though dietary supplements can be beneficial, they should not take the place of the variety of foods that are important for a healthy diet. Are There Any Risks in Taking Dietary Supplements? Dietary supplements may contain ingredients that can have strong effects in the body, so always be alert to the possibility of a bad reaction or side effect (also known as an adverse event). Problems can occur especially if you: • Take too much of some supplements • Combine supplements • Use supplements with medications (prescription or over-the-counter) • Take supplements instead of medications Adverse events can range from less serious to life-threatening and can include rash, fatigue, severe and persistent vomiting or diarrhea, difficulty urinating, severe joint and muscle pain, chest pain, or stroke. For more possible reactions, see www.fda.gov/dietarysupplements. What Should You Do if You Experience an Adverse Event? If you think that a dietary supplement may have caused you to experience an adverse event, you should: 1: STOP taking the supplement immediately 2: SEEK medical care 3: REPORT the adverse event to FDA • Online via the Safety Reporting Portal at www.safetyreporting.hhs.gov. • Call an FDA Consumer Complaint Coordinator. Contact information for your local Consumer Complaint Coordinator can be found at www.fda.gov/consumer-complaintcoordinators or by calling FDA’s SAFEFOOD Information Line at 1-888-SAFEFOOD (1-888-723-3366). Any information you provide can help FDA identify unsafe products on the market and take action to protect the public. How Can You Be an Informed Consumer? Read product labels, be cautious, and always talk to your healthcare professional—doctor, nurse, registered dietitian, or pharmacist— before purchasing or taking any dietary supplement. They can help you decide which supplements, if any, might be right for you."
    },
    {
      "title": "Dietary Supplements:Report Adverse Events to FDA",
      "link": "https://www.fda.gov/media/158339/download?attachment",
      "source": "FDA",
      "accessed_at": "05/05/2025",
      "content": "Dietary Supplements: Report Adverse Events to FDA Dietary supplements can be beneficial to your health, but they can also have unexpected consequences, especially if you start taking a new product, take supplements in high doses, take multiple supplements, or take supplements instead of or in addition to medications. Before deciding to take a dietary supplement, always talk to your healthcare professional. What is an Adverse Event? It is possible to experience an adverse event, also known as a side effect or bad reaction, while using dietary supplements. Adverse events may occur immediately or can happen sometime later and can range from less serious reactions to life-threatening illnesses, such as: • Itching, rash, hives, or wheezing • Fatigue or appetite loss • Severe, persistent nausea, vomiting, diarrhea, or abdominal pain • Difficulty urinating, decreased urination, or dark urine • Marked mood, cognitive, or behavioral changes • Severe joint or muscle pain • Yellowing of the skin or eyes • Abnormal bleeding from the nose or gums • Blood in urine, stool, or vomit • Throat, lip, or tongue swelling • Low blood pressure, fainting, chest pain, or shortness of breath • Stroke (slurred speech, one-sided weakness of face, arm, leg, or blurry/loss of vision) What Should I Do if I Experience an Adverse Event? If you are taking a dietary supplement and experience an adverse event, immediately stop using the product and seek medical care or advice. You should also submit a report to FDA through either: • The Safety Reporting Portal at www.safetyreporting.hhs.gov. • An FDA Consumer Complaint Coordinator. You can find the phone number for your local Consumer Complaint Coordinator at www.fda.gov/consumer-complaintcoordinators or by calling FDA’s SAFEFOOD Information Line at 1-888-SAFEFOOD (1-888-723-3366). Even if you aren’t sure the dietary supplement caused the adverse event, it’s always better to report it to FDA. Try to provide as much information as possible. Complete reports are the most useful, but even pieces of information can be helpful. Experiencing an Adverse Event? 1: STOP taking the supplement immediately 2: SEEK medical care 3: REPORT the adverse event to FDA Why Should I Report an Adverse Event? By law, FDA does not have the authority to approve dietary supplements before they are sold to the public. In fact, in most cases, FDA isn’t even notified when a dietary supplement is introduced to the market. However, when you report an adverse event associated with a dietary supplement, FDA can use the information you provide to help identify potentially dangerous products and possibly remove them from the market. In some cases, a single adverse event report can be very helpful to FDA in investigating and taking action to protect other consumers from unsafe products. That’s why it’s so important for you to notify FDA about any adverse reactions to a dietary supplement. To learn about dietary supplement-related actions that FDA has taken to protect the public health, visit: www.fda.gov/ dietarysupplements."
    },
    {
      "title": "Talking to Healthcare Professionals About Dietary Supplements",
      "link": "https://www.fda.gov/media/158338/download?attachment",
      "source": "FDA",
      "accessed_at": "05/05/2025",
      "content": "Talking to Healthcare Professionals About Dietary Supplements Dietary supplements can help you improve or maintain your overall health, and some can help you meet your daily requirements of essential nutrients. While supplements can be beneficial to your health, they can also involve health risks—especially if you take them with or instead of medications. Before deciding to take a supplement, do your research and always talk to your healthcare professional. Be an Informed Consumer When considering whether to take a dietary supplement, it’s important to know the facts. • Be cautious of products marketed as dietary supplements that claim to diagnose, cure, mitigate, treat, or prevent diseases. For example, a product that bears a claim such as “treats heart disease” or “cures cancer” is a drug and is subject to all requirements for drugs, even if it is marketed as a dietary supplement. • Be mindful of product claims, such as “works better than [a prescription drug],” “totally safe,” or has “no side effects.” If a claim sounds too good to be true, it probably is. • Search for information on credible websites (such as www.fda.gov, www.nih.gov, and www.usda.gov) and look for research studies published in peer reviewed journals. Speak with Your Healthcare Team To help you figure out what information is reliable, the best resource is your healthcare team. This team might include your doctor, nurse, pharmacist, or registered dietitian. They have access to the most current medical research and are the most familiar with your health history. They can help you determine if a dietary supplement is right for you. What to Ask Your Healthcare Professional Come prepared to your medical appointments with your research and questions about dietary supplements. For example: • Is taking a dietary supplement important for my overall health? • Am I taking the right product? • Am I taking the right amount? • Is there an amount or \"upper limit\" I should not go above? • How long should I take the supplement? • Are there any known side effects? • Are there any foods, medicines (prescription or over-the-counter), or other dietary supplements I should avoid while taking this product? • If I am scheduled for surgery or lab work, are there any supplements I should avoid? Symptoms to Watch Out For Sometimes dietary supplements can cause side effects or bad reactions, also known as adverse events, that can range from less serious to life-threatening. Some examples include itching, loss of appetite, severe or persistent abdominal pain, blood in the urine, shortness of breath, fainting, or cognitive changes. If you experience these or any other adverse events, immediately stop taking the supplement and seek medical care or advice. Did You Know? Dietary supplements can interact with some medicines (prescription and over-the-counter) and may cause problems. Some examples include: • St. John’s wort can reduce the effectiveness of some medications prescribed for heart disease, cancer, HIV, depression, seizures, and birth control. • Antioxidant supplements, such as vitamins C and E, might reduce the effectiveness of some types of cancer chemotherapy. • Vitamin K can reduce the ability of the blood thinner warfarin (Coumadin) to prevent blood from clotting. • Warfarin (Coumadin), ginkgo biloba, aspirin, and high-dose vitamin E can each thin the blood. Taking any of these products together can increase the potential for internal bleeding or stroke."
    },
    {
      "title": "Dietary Supplements: How FDA Helps Keep You Safe",
      "link": "https://www.fda.gov/media/158340/download?attachment",
      "source": "FDA",
      "accessed_at": "05/05/2025",
      "content": "Dietary Supplements: How FDA Helps Keep You Safe The Law The Dietary Supplement Health and Education Act of 1994 (DSHEA) defined dietary supplements and set out FDA’s authority regarding these products. Under DSHEA: • FDA does not have the authority to approve dietary supplements for safety and effectiveness or their labeling before they are sold in stores or online. • Dietary supplement companies are responsible for ensuring that their products are safe and label claims are truthful and substantiated. • Dietary supplement companies can introduce new dietary supplements to the market without receiving approval from FDA. In fact, they often can introduce dietary supplements to the market without even notifying FDA. FDA Regulates Even though FDA does not approve dietary supplements, there are product manufacturing and labeling requirements in place that supplement companies are required to follow. FDA oversees the dietary supplement marketplace by: Periodically inspecting dietary supplement manufacturing facilities to verify that companies are meeting all manufacturing and labeling requirements. Monitoring adverse event reports and complaints received from industry, healthcare professionals, and consumers FDA Takes Action When a product is found to be unsafe or otherwise not in compliance with FDA requirements, FDA can: • Work with the company to bring the product into compliance. • Ask the company to voluntarily recall the product. • Take action to remove a dangerous product from the market."
    },
    {
      "title": "Dietary Supplements",
      "link": "https://www.fda.gov/food/dietary-supplements",
      "source": "FDA",
      "accessed_at": "05/05/2025",
      "content": "Dietary Supplements The work of the FDA for dietary supplement oversight is coordinated by the Human Foods Program’s Office of Food Chemical Safety, Dietary Supplements, and Innovation. FDA regulates both finished dietary supplement products and dietary ingredients. FDA regulates dietary supplements under a different set of regulations than those covering \"conventional\" foods and drug products. Under the Dietary Supplement Health and Education Act of 1994 (DSHEA): Manufacturers and distributors of dietary supplements and dietary ingredients are prohibited from marketing products that are adulterated or misbranded. That means that these firms are responsible for evaluating the safety and labeling of their products before marketing to ensure that they meet all the requirements of the Federal Food, Drug, and Cosmetic Act as amended by DSHEA and FDA regulations. FDA has the authority to take action against any adulterated or misbranded dietary supplement product after it reaches the market."
    },
    {
      "title": "How to Report a Problem with Dietary Supplements",
      "link": "https://www.fda.gov/food/dietary-supplements/how-report-problem-dietary-supplements",
      "source": "FDA",
      "accessed_at": "05/05/2025",
      "content": "How to Report a Problem with Dietary Supplements Dietary supplements include vitamins, minerals, herbs, amino acids, whey protein, and creatine. FDA does not approve dietary supplements before they are sold to the public. Therefore, it is particularly important for consumers, healthcare professionals, and industry members to report health-related reactions or illnesses (also known as adverse events) to FDA, so we can evaluate the marketplace and take action to protect the public from possibly unsafe products. Serious reactions or illnesses may include: Itching, rash, hives, throat/lip/tongue swelling, or wheezing Low blood pressure, fainting, chest pain, shortness of breath, palpitations, or irregular heartbeat Severe, persistent nausea, vomiting, diarrhea, or abdominal pain Difficulty urinating, decreased urination, or dark urine Blood in urine, stool, vomit, or sputum Abnormal bleeding from nose or gums Fatigue or appetite loss Yellowing of the skin or eyes Severe joint or muscle pain Marked mood (irritability, anxiety), cognitive, or behavioral changes, thoughts of suicide Stroke (slurred speech, one-sided weakness of face, arm, leg, or blurry/loss of vision) Adverse reactions can even result in Emergency Room visits or hospitalization."
    },
    {
      "title": "Questions and Answers on Dietary Supplements",
      "link": "https://www.fda.gov/food/information-consumers-using-dietary-supplements/questions-and-answers-dietary-supplements",
      "source": "FDA",
      "accessed_at": "05/05/2025",
      "content": "Questions and Answers on Dietary Supplements What is a dietary supplement? Congress defined the term \"dietary supplement\" in the Dietary Supplement Health and Education Act (DSHEA) of 1994. A dietary supplement is a product intended for ingestion that, among other requirements, contains a \"dietary ingredient\" intended to supplement the diet. The term \"dietary ingredient\" includes vitamins and minerals; herbs and other botanicals; amino acids; \"dietary substances\" that are part of the food supply, such as enzymes and live microbials (commonly referred to as \"probiotics\"); and concentrates, metabolites, constituents, extracts, or combinations of any dietary ingredient from the preceding categories. There are two types of ingredients that may be used in dietary supplements: “dietary ingredients,” discussed above, and “other ingredients.” These “other ingredients” include substances such as fillers, binders, excipients, preservatives, sweeteners, and flavorings. Dietary supplements are products that are ingested – specifically, they must be swallowed – so, for example, topical or inhaled products are not supplements. Dietary supplements may be found in many forms, such as pills, tablets, capsules, gummies, softgels, liquids, and powders. They can also be in the same form as a conventional food category, such as teas or bars, but only if the product is not represented as a conventional food or as a \"sole item of a meal or the diet.\" To be a dietary supplement, a product must also be labeled as a dietary supplement; that is, the product label must include the term \"dietary supplement\" or equivalent (e.g., \"iron supplement\" or \"herbal supplement\"). Generally, the dietary supplement definition excludes ingredients that are approved as new drugs, licensed as biologics, or authorized for clinical investigation under an investigational new drug application (IND) that has gone into effect, unless the ingredient was previously marketed as a dietary supplement or as a food. In the case of ingredients authorized for clinical investigation under an IND, the exclusion from the dietary supplement definition applies only if \"substantial clinical investigations\" have been instituted and the existence of such investigations has been made public. What is a \"new dietary ingredient\" in a dietary supplement? The Dietary Supplement Health and Education Act (DSHEA) of 1994 defined the terms \"dietary ingredient\" and \"new dietary ingredient.\" To be a \"dietary ingredient,\" an ingredient in a dietary supplement must be one of the following: a vitamin, a mineral, an herb or other botanical, an amino acid, a dietary substance for use by man to supplement the diet by increasing the total dietary intake, or a concentrate, metabolite, constituent, extract, or combination of any dietary ingredient from the other categories listed above. A \"new dietary ingredient\" is an ingredient that meets the definition of a \"dietary ingredient\" and was not marketed in the United States before October 15, 1994. Should I check with my doctor or health care provider before using a dietary supplement? Yes. FDA advises consumers to talk to their doctor, pharmacist, or other health care professional before deciding to purchase or use a dietary supplement. For example, some supplements might interact with medicines or other supplements. Please see Information for Consumers on Using Dietary Supplements for additional educational materials. What is FDA's role in regulating dietary supplements versus the manufacturer's responsibility for marketing them? The Dietary Supplement Health and Education Act (DSHEA) amended the Federal Food, Drug, and Cosmetic Act (FD&C Act) to create a new regulatory framework for dietary supplements. Under DSHEA, FDA does not have the authority to approve dietary supplements before they are marketed. Generally, a firm does not have to provide FDA with the evidence it relies on to substantiate safety before or after it markets its products; however, there is an exception for dietary supplements that contain a new dietary ingredient that is not present in the food supply as an article used for food in a form in which the food has not been chemically altered. At least 75 days before introducing such a dietary supplement into interstate commerce or delivering it for introduction into interstate commerce, the manufacturer or distributor must submit a notification to FDA with the information on the basis of which the firm has concluded that the NDI-containing dietary supplement will reasonably be expected to be safe. In addition, FDA’s regulations require those who manufacture, package, or hold dietary supplements to follow current good manufacturing practices that help ensure the identity, purity, quality, strength, and composition of dietary supplements. FDA generally does not approve dietary supplement claims or other labeling before use. Under the FD&C Act, a firm is responsible for ensuring that the dietary supplements it manufactures or distributes are not adulterated, misbranded, or otherwise in violation of federal law. If a manufacturer or distributor makes a structure/function claim (a claim about effects on a structure or function of the human body), a claim of a benefit related to a classical nutrient deficiency disease, or a claim of general well-being in the labeling of a dietary supplement, the firm must have substantiation that the claim is truthful and not misleading. Facilities that manufacture, process, pack, or hold dietary supplements or dietary ingredients for consumption in the United States must register with FDA, as required by the Public Health Security and Bioterrorism Preparedness and Response Act of 2002 and implementing regulations, before beginning such operations. FDA is responsible for enforcing the laws and regulations governing dietary supplements. To identify violations, the agency conducts inspections, monitors the marketplace, examines dietary supplements and dietary ingredients offered for import, and reviews NDI notifications and other regulatory submissions for dietary supplements (e.g., postmarket notifications of a structure/function claim or other claim made under section 403(r)(6) of the FD&C Act (21 U.S.C. 343(r)(6)). We also investigate adverse event reports and complaints from consumers, health care professionals, other regulatory agencies, and industry. When must a manufacturer or distributor notify FDA about a dietary supplement it intends to market in the United States? The Dietary Supplement Health and Education Act (DSHEA) requires that a manufacturer or distributor notify FDA in advance and submit safety information if it intends to market a dietary supplement in the United States that contains a \"new dietary ingredient,\" unless the new dietary ingredient is present in the food supply as an article used for food in a form in which the food has not been chemically altered. The notification must be submitted to FDA at least 75 days before introducing the product into interstate commerce or delivering it for introduction into interstate commerce. Along with information about the new dietary ingredient and the dietary supplement in which it will be marketed, the notification must include the safety information on which the notifier has based its conclusion that the new dietary ingredient will be reasonably expected to be safe when used under the conditions recommended or suggested in the labeling of the dietary supplement. What information must the manufacturer disclose on the label of a dietary supplement? FDA regulations require dietary supplement labels to bear a product name and a statement that it is a \"dietary supplement\" or equivalent term replacing \"dietary\" with the name or type of dietary ingredient in the product (e.g., \"iron supplement\" or \"herbal supplement\"); the name and place of business of the manufacturer, packer, or distributor; nutrition labeling in the form of a \"Supplement Facts\" panel (except for some small volume products or those produced by eligible small businesses); a list of \"other ingredients\" not declared in the Supplement Facts panel; and the net quantity of contents. The Supplement Facts panel must list the serving size and number of servings per container, declare each dietary ingredient in the product, and except for dietary ingredients that are part of a proprietary blend, provide information on the amount of the dietary ingredient per serving. Depending on the type of ingredient, the amount per serving must be declared as a quantitative amount by weight, as a percentage of the Daily Value, or both. Finally, dietary supplement labels must provide a domestic address or domestic phone number for reporting serious adverse events to the manufacturer, packer, or distributor whose name and place of business are listed on the label. Must all ingredients be declared on the label of a dietary supplement? Yes, ingredients not listed on the \"Supplement Facts\" panel must be listed in the \"Other Ingredients\" list beneath. The types of ingredients listed there could include the sources of dietary ingredients, if not listed in the \"Supplement Facts\" panel (e.g., rose hips as the source of vitamin C), other food ingredients (e.g., water and sugar), food additives, and color additives. Gelatin, starch, stabilizers, preservatives, and flavors are additional examples of ingredients commonly declared in the \"Other Ingredients\" list. Are dietary supplement serving sizes standardized or are there restrictions on the amount of a dietary ingredient that can be in one serving? Other than the manufacturer's responsibility to meet the safety standards and labeling requirements for dietary supplements and to comply with current good manufacturing regulations, there are no laws or regulations that limit the serving size of a dietary supplement or the amount of a dietary ingredient that can be in a serving of a dietary supplement. This decision is made by the manufacturer and does not require FDA approval. Where can I get information about a specific dietary supplement? Because FDA does not approve dietary supplements before they are marketed, the agency often does not know when new products come on the market. Therefore, we are not able to keep a complete list of all dietary supplements sold in the United States. If you want more detailed information about a specific dietary supplement than the label provides, we recommend that you contact the manufacturer of the product directly. The name and address of the manufacturer or distributor can be found on the label of the dietary supplement. Who has the responsibility for ensuring that a product meets the safety standards for dietary supplements? Because the law prohibits the distribution and sale of adulterated dietary supplements, manufacturers and distributors have initial responsibility for ensuring that their dietary supplements meet the safety standards for dietary supplements. When manufacturers and distributors do not fulfill that responsibility and adulterated dietary supplements reach the market, FDA has authority to enforce the law to protect consumers. In general, FDA is limited to postmarket enforcement because, unlike drugs that must be proven safe and effective for their intended use before marketing, there are no provisions in the law for FDA to approve dietary supplements for safety before they reach the consumer. However, manufacturers and distributors of dietary supplements must record, investigate, and forward to FDA any reports they receive of serious adverse events associated with the use of their products. FDA evaluates these reports and any other adverse event information reported by health care providers or consumers to identify early signals that a product may present safety risks to consumers. You can find more information on reporting adverse events associated with the use of dietary supplements at How to Report a Problem with Dietary Supplements. How can consumers inform themselves about safety and other issues related to dietary supplements? It is important to be well informed about health-related products before purchasing them. FDA advises consumers to consult with a health care professional before deciding to take a dietary supplement. Consumers should also carefully read the label of any dietary supplement they are thinking of using. To help consumers in their search to be better informed, FDA has prepared additional educational materials. Please visit Information for Consumers on Using Dietary Supplements. What is FDA's oversight responsibility for dietary supplements? Because dietary supplements are under the \"umbrella\" of foods, FDA's Center for Food Safety and Applied Nutrition (CFSAN) is primarily responsible for the agency's oversight of these products. FDA’s role in regulating dietary supplements includes (among other things) inspecting dietary supplement manufacturing establishments, reviewing new dietary ingredient (NDI) notifications and other regulatory submissions for dietary supplements, investigating complaints, monitoring the dietary supplement marketplace, examining dietary supplements and dietary ingredients offered for import to determine whether they meet U.S. requirements, and reviewing adverse event reports from firms, consumers, and health care providers to identify products that may be unsafe. However, by law, FDA does not approve dietary supplements or their labeling, although certain types of claims sometimes used in dietary supplement labeling require premarket review and authorization (e.g., health claims). Does FDA routinely analyze the content of dietary supplements? No. FDA has limited resources to analyze the composition of food products, including dietary supplements, and, therefore, focuses its resources first on public health emergencies and products that may have caused injury or illness. Priority then goes to products suspected to be adulterated, fraudulent, or otherwise in violation of the law. The remaining resources are used to analyze product samples collected during inspections of manufacturing firms or pulled from store shelves as part of FDA’s routine monitoring of the marketplace. FDA does not test dietary supplements before they are sold to consumers. Consumers may contact the dietary supplement manufacturer or a commercial laboratory for an analysis of a product’s content. Is it legal to market a dietary supplement product to treat, prevent, or cure a specific disease? No, a product sold as a dietary supplement and represented explicitly or implicitly for treatment, prevention, or cure of a specific disease or class of diseases meets the definition of a drug and is subject to regulation as a drug. How are advertisements for dietary supplements regulated? The Federal Trade Commission (FTC) regulates advertising, including infomercials, for dietary supplements. FDA and FTC share responsibility for the oversight of dietary supplements and related promotion, with FDA generally responsible for safety, quality, and labeling, and FTC generally responsible for advertising. Both FDA and FTC have the authority to take enforcement actions against dietary supplements and firms if they identify violations. In addition, FDA considers advertising when evaluating the intended use of a product labeled as a dietary supplement. For more information on FTC’s role in regulating dietary supplement advertising, please visit the FTC website. Advertising and other promotional material sent through the mail are also subject to regulation by the U.S. Postal Inspection Service. What kinds of claims can be made on dietary supplement labels? Among the claims that can be used on dietary supplement labels are three categories of claims that are defined by the FD&C Act and FDA regulations: health claims (claims about the relationship between a dietary ingredient or other food substance and reduced risk of a disease or health-related condition), structure/function claims (claims about effects on a structure or function of the human body), and nutrient content claims (claims characterizing the level of a nutrient or other dietary ingredient in a dietary supplement). Different requirements apply to each of these claim types. For more information on the regulation of health claims, structure/function claims, and nutrient content claims, please see Label Claims for Conventional Foods and Dietary Supplements. Two less common types of dietary supplement labeling claims defined by statute are claims of a benefit related to a classical nutrient deficiency disease (when accompanied by a statement disclosing the prevalence of the nutrient deficiency disease in the United States) and claims of general well-being from consumption of a nutrient or other dietary ingredient. These dietary supplement claims are subject to the same requirements as structure/function claims, including the disclaimer that must accompany the claim and the requirement for the manufacturer to have substantiation that the claim is truthful and non-misleading. Finally, dietary supplements, like conventional foods, may make other labeling claims that are not defined by statute or regulation (e.g., claims about taste or ingredient quality), as long as those claims are not false or misleading. Who regulates the use of the term “organic” on dietary supplements under the National Organic Program? The U.S. Department of Agriculture (USDA) regulates the use of the term “organic” under the National Organic Program (NOP). NOP is a federal regulatory program that develops and enforces consistent national standards for organically produced agricultural products sold in the United States. Why do some dietary supplements have wording on the label that says: \"This statement has not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease\"? This statement, known as a \"disclaimer,\" is required by law (21 U.S.C. 343(r)(6)(C) and 21 CFR 101.93(b)–(d)) when a manufacturer makes a structure/function claim or certain other claims in dietary supplement labeling. In general, structure/function claims describe the role of a nutrient or dietary ingredient intended to affect the structure or function of the body in humans or characterize the documented mechanism by which a nutrient or dietary ingredient acts to maintain such structure or function. The other dietary supplement labeling claims that require the disclaimer are claims of a benefit related to a classical nutrient deficiency disease and claims of general well-being from consumption of a dietary ingredient. These three types of claims are not approved by FDA and do not require FDA evaluation before they are used in dietary supplement labeling. Accordingly, DSHEA requires that when a dietary supplement label or other labeling includes such a claim, the claim must be accompanied by a disclaimer informing consumers that FDA has not evaluated the claim. The disclaimer must also state that the product is not intended to \"diagnose, treat, cure, or prevent any disease\" because only a drug can legally make such a claim. How do consumers and health care providers report a problem or illness related to a dietary supplement to FDA? If you think you have suffered a harmful effect or illness (an \"adverse event\") from a dietary supplement, the first thing you should do is contact or see your health care provider immediately. Then, you or your health care provider can report the adverse event to FDA by submitting a report through the Safety Reporting Portal. FDA would like to know when you experience a health problem thought to be related to a dietary supplement, even if you are unsure the product caused the problem and even if you do not visit a doctor or clinic. Anyone may report an adverse event thought to be related to a dietary supplement directly to FDA by accessing the Safety Reporting Portal. Consumers are also encouraged to report instances of product problems using the Safety Reporting Portal. Examples of product problems are foreign objects in the packaging or other apparent quality defects. NOTE: The identity of the patient and the reporter of the adverse event are kept confidential. For a general complaint or concern about food products, including dietary supplements, visit Industry and Consumer Assistance."
    },
    {
      "title": "FDA 101: Dietary Supplements",
      "link": "https://www.fda.gov/consumers/consumer-updates/fda-101-dietary-supplements",
      "source": "FDA",
      "accessed_at": "30/05/2025",
      "content": "FDA 101: Dietary Supplements Dietary supplements can help improve health but can also have risks. Get the facts on supplements and how the FDA regulates them to help keep you safe. Multivitamins, vitamin D, echinacea, and fish oil are among the many dietary supplements lining store shelves or available online. Perhaps you already take a supplement or are thinking about using one. Dietary supplements can be beneficial to your health, but they can also involve health risks. So, it’s important that you talk with a health care professional to help you decide if a supplement is right for you.  Read on to learn what dietary supplements are, are not, what role the U.S. Food and Drug Administration has in regulating them, and how to make sure you and your family use supplements safely.  What Are Dietary Supplements? Dietary supplements are intended to add to or supplement the diet and are different from conventional food. Generally, to the extent a product is intended to treat, diagnose, cure, or prevent diseases, it is a drug, even if it is labeled as a dietary supplement. Supplements are ingested and come in many forms, including tablets, capsules, soft gels, gel caps, powders, bars, gummies, and liquids.  Common supplements include:  Vitamins: such as multivitamins or individual vitamins like vitamin D and biotin Minerals: such as calcium, magnesium, and iron Botanicals or herbs: such as echinacea and ginger Botanical compounds: such as caffeine and curcumin Amino acids: such as tryptophan and glutamine Live microbials: commonly referred to as “probiotics” What Are the Benefits of Dietary Supplements? Dietary supplements can help you improve or maintain your overall health, and supplements can also help you meet your daily requirements of essential nutrients.  For example, calcium and vitamin D can help build strong bones, and fiber can help to maintain bowel regularity. While the benefits of some supplements are well established, other supplements need more study. Also, keep in mind that supplements should not take the place of the variety of foods that are important for a healthy diet.  What Are the Risks of Dietary Supplements? Before buying or taking a dietary supplement, talk with a health care professional—such as your doctor, nurse, registered dietician, or pharmacist—about the benefits and risks.  Many supplements contain ingredients that can have strong effects in the body. Additionally, some supplements can interact with medications, interfere with lab tests, or have dangerous effects during surgery. Your health care professional can help you decide what supplement, if any, is right for you.  When taking dietary supplements, be alert to the possibility of a bad reaction or side effect, also known as an adverse event.  Problems can occur especially if you:  Combine supplements Mix medicines and supplements Take too much of some supplements Take supplements instead of medications If you experience an adverse event while taking a dietary supplement, immediately stop using the supplement, seek medical care or advice, and report the adverse event to the FDA.  How Are Dietary Supplements Regulated? The Law The Federal Food, Drug, and Cosmetic Act was amended in 1994 by the Dietary Supplement Health and Education Act, often referred to as DSHEA, which defined “dietary supplement” and set out the FDA’s authority regarding such products. Under existing law:  The FDA does NOT have the authority to approve dietary supplements for safety and effectiveness, or to approve their labeling, before the supplements are sold to the public. Under the FD&C Act, it is the responsibility of dietary supplement companies to ensure their products meet the safety standards for dietary supplements and are not otherwise in violation of the law. Dietary supplement labels are required to have nutrition information in the form of a Supplement Facts label that includes the serving size, the number of servings per container, a listing of all dietary ingredients in the product, and the amount per serving of those ingredients. They also must have a statement on the front of the product identifying it as a “dietary supplement” or similar descriptive term, e.g., “herbal supplement” or “calcium supplement”.  In general, even if a product is labeled as a dietary supplement, a product intended to treat, prevent, cure, or alleviate the symptoms of a disease is a drug, and subject to all requirements that apply to drugs.  The FDA’s Role and Actions to Help Keep You Safe Even though the FDA does not approve dietary supplements, there are roles for the agency in regulating them.  Since companies can often introduce a dietary supplement to the market without notifying the FDA, the agency's role in regulating supplements primarily begins after the product enters the marketplace. The FDA periodically inspects dietary supplement manufacturing facilities to verify companies are meeting applicable manufacturing and labeling requirements. The FDA also reviews product labels and other labeling information, including websites, to ensure products are appropriately labeled and that they do not include claims that may render the products drugs, e.g., claims to treat, diagnose, cure, or prevent diseases. The FDA monitors adverse event reports submitted by dietary supplement companies, health care professionals, and consumers as well as other product complaints for valuable information about the safety of products once they are on the market. If a product is found to be unsafe or doesn’t otherwise comply with the law, the FDA can: Work with the company to bring the product into compliance. Ask the company to voluntarily recall the product. Take action to remove a dangerous product from the market. Tips to Be a Safe and Informed Consumer Before taking a dietary supplement, talk with your health care professional. They can help you decide which supplements, if any, are right for you. You can also contact the manufacturer for information about the product.  Take only as described on the label. Some ingredients and products can be harmful when consumed in high amounts, when taken for a long time, or when used in combination with certain drugs or foods. Do not substitute a dietary supplement for a prescription medicine or for the variety of foods important to a healthy diet. Do not assume that the term \"natural\" to describe a product ensures that it is safe. Be wary of hype. Sound health advice is generally based upon research over time, not a single study. Learn to spot false claims. If something sounds too good to be true, it probably is. Why Is It Important to Report an Adverse Event? If you experience adverse event, also known as a side effect or bad reaction, the FDA encourages both you and your health care professional to report the adverse event to the FDA.  You can help the FDA, yourself, and other consumers by reporting an adverse event. A single adverse event report can help us identify a potentially dangerous product and possibly remove it from the market.  For a list of potential serious reactions to watch for, and to learn how to report an adverse event, please see the FDA’s webpage, How to Report a Problem with Dietary Supplements.  Adverse events can also be reported to the product's manufacturer or distributor through the address or phone number listed on the product's label. Dietary supplement firms are required to report serious adverse events they receive about their dietary supplements to the FDA within 15 days.  As a part of FDA modernization efforts for field operations, all of our Centers now directly receive reports of problems or adverse reactions with FDA-regulated products. Please direct concerns to the appropriate FDA center by visiting our SmartHub webpage, which will guide you to the appropriate webform or phone number.  If you are not able to use the SmartHub, you may also call 1-888-INFO-FDA and follow the prompts to report a problem. If you require the use of a Relay Service, please call the Federal Relay Services at 800-877-8339. This is a toll-free relay service to call federal agencies from TTY devices.  NOTE: The ORA consumer complaint coordinator telephone numbers previously available are no longer in use.  Additional Resources:"
    },
    {
      "title": "Dietary Supplements: What You Need to Know",
      "link": "https://ods.od.nih.gov/factsheets/WYNTK-Consumer/",
      "source": "NIH",
      "accessed_at": "30/05/2025",
      "content": "Many adults and children in the United States take one or more vitamins or other dietary supplements. In addition to vitamins, dietary supplements can contain minerals, herbs or other botanicals, amino acids, enzymes, and many other ingredients. Dietary supplements come in a variety of forms, including tablets, capsules, gummies, and powders as well as drinks and energy bars. Popular supplements include vitamins D and B12; minerals like calcium and iron; herbs such as echinacea and garlic; and products like glucosamine, probiotics, and fish oils.  The Dietary Supplement Label Products sold as dietary supplements come with a Supplement Facts label that lists the active ingredients, the amount per serving (dose), and other ingredients, such as fillers, binders, and flavorings. The manufacturer suggests the serving size, but your health care provider might decide a different amount is more appropriate for you.  Effectiveness Some dietary supplements can help you get adequate amounts of essential nutrients if you don’t eat a nutritious variety of foods. However, supplements can’t take the place of the variety of foods that are important to a healthy eating routine. To learn more about what makes a healthy eating routine, the Dietary Guidelines for Americansexternal link disclaimer and MyPlateexternal link disclaimer are good sources of information.  Some dietary supplements can improve overall health and help manage some health conditions. For example:   Calcium and vitamin D help keep bones strong and reduce bone loss.  Folic acid decreases the risk of certain birth defects. Omega-3 fatty acids from fish oils might help some people with heart disease.  A combination of vitamins C and E, zinc, copper, lutein, and zeaxanthin (known as an Age-Related Eye Disease Study [AREDS] formula) may slow down further vision loss in people with age-related macular degeneration (AMD).  Many other supplements need more study to determine if they have value. The U.S. Food and Drug Administration (FDA) does not determine whether dietary supplements are effective before they are marketed.  Safety and Risk Many supplements contain active ingredients that can have strong effects on the body. Always be alert to the possibility of a bad reaction, especially when taking a new product.  You are most likely to have side effects from dietary supplements if you take them at high doses, or instead of prescribed medicines, or if you take many different supplements. Some supplements can increase the risk of bleeding or, if taken before surgery, can change your response to anesthesia. Supplements can also interact with some medicines in ways that might cause problems. Here are a few examples:  Vitamin K can reduce the ability of the blood thinner warfarin to prevent blood from clotting. St. John’s wort can speed the breakdown of many medicines and reduce their effectiveness (including some antidepressants, birth control pills, heart medications, anti-HIV medications, and transplant drugs). Antioxidant supplements, such as vitamins C and E, might reduce the effectiveness of some types of cancer chemotherapy. Manufacturers may add vitamins, minerals, and other supplement ingredients to foods you eat, especially breakfast cereals and beverages. As a result, you may get more of these ingredients than you think, and more might not be better. Taking more than you need costs more and might also raise your risk of side effects. For example, too much vitamin A can cause headaches and liver damage, reduce bone strength, and cause birth defects. Excess iron causes nausea and vomiting and may damage the liver and other organs.  Be cautious about taking dietary supplements, beyond a standard prenatal supplement, if you are pregnant or nursing. Also, be careful about giving supplements to a child, unless recommended by their health care provider. Many supplements have not been well tested for safety in children and in women who are pregnant or nursing.  If you think that you have had a bad reaction to a dietary supplement, let your health care provider know. They may report your experience to FDA. You may also submit a report directly to FDA by calling 800-FDA-1088 or completing an online formexternal link disclaimer. You should also report your reaction to the manufacturer by using the contact information on the product label.  Quality FDA has established Good Manufacturing Practices (GMPs) that companies must follow to help ensure the identity, purity, strength, and composition of their dietary supplements. These GMPs can prevent adding the wrong ingredient (or too much or too little of the correct ingredient) and reduce the chance of contamination or improper packaging and labeling of a product. FDA periodically inspects facilities that manufacture supplements.  Several independent organizations offer quality testing and allow products that pass these tests to display a seal of quality assurance that indicates the product was properly manufactured, contains the ingredients listed on the label, and does not contain harmful levels of contaminants. These seals do not guarantee that a product is safe or effective. Organizations that offer quality testing include:*  ConsumerLab.com NSF International U.S. Pharmacopeia       * Any mention of a specific company, organization, or service does not represent an endorsement by ODS.  Talk with Your Health Care Providers Tell your health care providers (including doctors, dentists, pharmacists, and dietitians) about any dietary supplements you’re taking. They can help you determine which supplements, if any, might be valuable for you.  Keep a complete record of any dietary supplements and medicines you take. The Office of Dietary Supplements website has a useful form, My Dietary Supplement and Medicine Record, that you can print and fill out at home. For each product, note the name, the dose you take, how often you take it, and the reason for use. You can share this record with your health care providers to discuss what’s best for your overall health.   Keep in Mind Consult your health care provider before taking dietary supplements to treat a health condition. Get your health care provider’s approval before taking dietary supplements in place of, or in combination with, prescribed medicines. If you are scheduled to have any type of surgical procedure, talk with your health care provider about any supplements you take.  Keep in mind the term natural doesn’t always mean safe. Some all-natural botanical products, for example comfrey and kava, can harm the liver. A dietary supplement’s safety depends on many things, such as its chemical makeup, how it works in the body, how it is prepared, and the amount you take.  Before taking any dietary supplement, use the information sources listed in this fact sheet and talk to your health care providers to answer these questions: What are its potential benefits for me? Does it have any safety risks? What is the proper dose to take? How, when, and for how long should I take it?  Federal Regulation of Dietary Supplements Dietary supplements are products intended to supplement the diet. They are not medicines and are not intended to treat, diagnose, mitigate, prevent, or cure diseases. FDA is the federal agency that oversees both supplements and medicines, but FDA regulations for dietary supplements are different from those for prescription or over-the-counter medicines.  Medicines must be approved by FDA before they can be sold or marketed. Supplements do not require this approval. Supplement companies are responsible for having evidence that their products are safe, and the label claims are truthful and not misleading. However, as long as the product does not contain a new dietary ingredient (one introduced since October 15, 1994), the company does not have to provide this safety evidence to FDA before the product is marketed.  Dietary supplement labels may include certain types of health-related claims. Manufacturers are permitted to say, for example, that a supplement promotes health or supports a body part or function (like heart health or the immune system). These claims must be followed by the words, “This statement has not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.”  Manufacturers must follow GMPs to ensure the identity, purity, strength, and composition of their products. If FDA finds a dietary supplement to be unsafe, it may remove the product from the marketplace or ask the manufacturer to voluntarily recall the product.  FDA monitors the marketplace for potential illegal products that may be unsafe or make false or misleading claims. The Federal Trade Commission, which monitors product advertising, also requires information about a supplement product to be truthful and not misleading.  The federal government can take legal action against companies and websites that sell dietary supplements when the companies make false or deceptive statements about their products, if they promote them as treatments or cures for diseases, or if their products are unsafe."
    },
    {
      "title": "Food supplements",
      "link": "https://www.efsa.europa.eu/en/topics/topic/food-supplements",
      "source": "EFSA",
      "accessed_at": "30/05/2025",
      "content": "Food supplements are concentrated sources of nutrients (i.e. mineral and vitamins) or other substances with a nutritional or physiological effect that are marketed in “dose” form (e.g. pills, tablets, capsules, liquids in measured doses). A wide range of nutrients and other ingredients might be present in food supplements, including, but not limited to, vitamins, minerals, amino acids, essential fatty acids, fibre and various plants and herbal extracts.  In the EU, food supplements are regulated as foods. Harmonised legislation regulates the vitamins and minerals, and the substances used as their sources, which can be used in the manufacturing of food supplements. For ingredients other than vitamins and minerals, the European Commission has established harmonised rules to protect consumers against potential health risks and maintains a list of substances which are known or suspected to have adverse effects on health and the use of which is therefore controlled.  1. Who is responsible for the safety of food supplements and for monitoring these products in the EU? Because food supplements are considered as food, it is the responsibility of the manufacturer, importer, supplier or distributor to ensure that a food supplement placed on the market is safe.  Member States may, for monitoring purposes, request notification of the placing on the market in their territory of a food supplement. Once the product is on the market, the competent authority of the Member State may monitor its use in that territory.  List of competent authorities of the EU Member States  2. Which ingredients are authorised for use in food supplements? Annex I of Directive 2002/46/EC lays down a list of vitamins and minerals that may be added for nutritional purposes to food supplements (e.g. vitamin C, calcium). Annex II of the same directive contains a list of substances that are authorised as source of the vitamins and minerals listed in Annex I (e.g. sodium-L-ascorbate as a source of vitamin C, calcium lactate as a source of calcium).  The use of ingredients other than vitamins and minerals (e.g. botanicals) in the manufacture of food supplements may also be authorised under other specific legislations depending on the nature of the substance (e.g. novel foods, substances for the fortification of food, foods for specific groups).  Substances not falling in the above categories may still be found in food supplements present on national markets subject to provisions in the specific national legislations.  In addition to the substances added for nutritional purposes, food supplements may also contain food additives, i.e. substances added to the products for technological reasons (e.g. coating agents for tablets, sweeteners). The list of food additives that are permitted for use in food supplements can be found in Regulation (EC) No 1333/2008.  3. What are the maximum and minimum levels of vitamins and minerals allowed in EU food supplements? There are at present no binding maximum and minimum levels for the ingredients of food supplements defined in the European Union. Directive 2002/46/EC envisages the maximum and minimum levels being defined in consultation between the European Commission, Members States and interested stakeholders. Due to the complex nature of the issue and the divergent views expressed by the parties involved, this process is ongoing and no final conclusion has been reached. The activities of EFSA in establishing tolerable upper intake levels (ULs) of individual micronutrients for different population groups provide support to the European Commission in establishing maximum limits for vitamins and minerals in food supplements and fortified foods.  4. What are the labelling requirements for food supplements on the EU market? Directive 2002/46/EC sets out specific labelling requirements for food supplements. These include:  the names of the categories of nutrients or substances that characterise the product or an indication of the nature of those nutrients or substances; the portion of the product recommended for daily consumption; a warning not to exceed the stated recommended daily dose; a statement to the effect that food supplements should not be used as a substitute for a varied diet; a statement to the effect that the products should be stored out of the reach of young children. In addition, presentation and advertising must not attribute to food supplements the property of preventing, treating or curing a human disease, or refer to such properties.  5. Are there substances that are prohibited or restricted for use in food supplements? The European Commission, on its own initiative or on the basis of information provided by the Member States and following an assessment by EFSA, may take a decision to include a certain substance in a list of substances whose use in foods is prohibited, restricted or under scrutiny. This may happen when the addition of a substance in food products increases its exposure to levels greatly exceeding the normal consumption and/or poses a potential risk to consumers. This procedure is defined in art. 8 of Regulation (EC) No 1925/2006 and the substances whose use in foods is prohibited, restricted or under scrutiny are listed in its Annex III."
    },
    {
      "title": "Food supplements",
      "link": "https://www.efsa.europa.eu/en/safe2eat/food-supplements",
      "source": "EFSA",
      "accessed_at": "30/05/2025",
      "content": "Food supplements Can a pill a day keep the doctor away? Exploring food supplements and their role in health Food supplements, often a part of daily routines, have grown in popularity across the EU. With products ranging from vitamin D to herbal extracts like ginseng and garlic, these supplements are marketed as convenient ways to maintain health, support performance, or boost immunity. But remember, supplements should complement, not replace, a nutritious diet and healthy lifestyle.  Understanding food supplements and their benefits Food or dietary supplements are concentrated sources of nutrients such as vitamins, minerals, amino acids, enzymes, and botanicals, available in forms like tablets, capsules, powders, and liquids. They’re sold in pharmacies, supermarkets, specialized stores, and online. While many supplements have a history of use in Europe, there are safety and quality concerns, such as contamination risks and the need to ensure that concentrations of bioactive agents remain within safe limits.  Food supplements are mainly evaluated and regulated at national level in the EU. But, EFSA plays a pivotal role in ensuring safety by providing scientific opinions on substances used in supplements, particularly those without a history of safe use in the EU before 1997 or upon request of a Member State.  Botanicals in food supplements Botanicals—preparations derived from plants, algae, fungi, or lichens—are common in EU food supplements. Popular examples include:  Ginseng: promoted for its energy-boosting properties. Ginkgo biloba: often marketed for cognitive support. Garlic: linked to heart health. While their usage is widespread, their effects can vary, and some may interact with medications or cause adverse reactions.  Do you need food supplements? Food supplements serve specific purposes:  Addressing deficiencies: for groups like pregnant women or those with limited sun exposure. Supporting performance: in sports or cognitive tasks. Maintaining general health: complementing a healthy lifestyle. However, they are not a substitute for a balanced diet. Most people meet their nutrient needs through food, with vitamin D being a notable exception in regions with low sun exposure. Overconsumption of supplements can lead to harmful effects, as higher doses aren’t necessarily better for health. Regulation and safety in the EU Manufacturers must ensure their products are safe, labeled appropriately, and meet established nutrient levels. European scientists evaluate substances lacking a history of safe use and provide guidance on potential risks.  Key takeaways for consumers  Choose wisely: Consult a healthcare professional before starting supplements. Focus on diet first: A balanced diet is the cornerstone of health. Stay informed: Look for trusted sources and verified products. For more information on food supplements, visit EFSA’s Food Safety Campaign. By understanding the role of supplements, consumers can make informed decisions to support their health while minimising risks. Remember, supplements should complement, not replace, a nutritious diet and healthy lifestyle."
    }
  ]
}