{
  "supplements": [
    {
      "title": "Zinc",
      "link": "https://medlineplus.gov/druginfo/natural/982.html",
      "source": "MedlinePlus",
      "date": "12/02/2025",
      "content": "What is it?: Zinc is an essential trace element commonly found in red meat, poultry, and fish. It is necessary in small amounts for human health, growth, and sense of taste. Zinc is found throughout the body. The body doesn't store excess zinc, so it must be obtained from the diet. It's needed for immune function, wound healing, blood clotting, thyroid function, and much more. It also plays a key role in maintaining vision and might have effects against viruses. People commonly use zinc for zinc deficiency, diarrhea, and Wilson disease. Zinc is also used for acne, diabetes, anorexia, burns, and many other purposes. There is some scientific evidence to support its use for some of these conditions. But for most, there is no good scientific evidence to support its use. There is also no good evidence to support using zinc for COVID-19. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for ZINC are as follows: There is interest in using zinc for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Effective for...: Zinc deficiency. Taking zinc by mouth or giving zinc by IV helps to restore zinc levels in people who are zinc deficient. But taking zinc supplements regularly isn't recommended. IV products can only be given by a healthcare provider. Likely effective for...: Diarrhea. Taking zinc by mouth reduces the duration and severity of diarrhea in children who are undernourished. Zinc 20 mg daily is the most common dose used. But doses of 5-10 mg also seem to work and cause less vomiting. An inherited disorder that causes copper to build up in many organs (Wilson disease). Taking zinc by mouth improves symptoms of this condition. Zinc blocks how much copper is absorbed and increases how much copper the body releases. Possibly effective for...: Acne. Taking zinc by mouth seems to help treat acne. But it's unclear how zinc compares to acne medications such as tetracycline or minocycline. Applying zinc to the skin alone in an ointment doesn't seem to help. A disorder of zinc deficiency (acrodermatitis enteropathica). Taking zinc by mouth seems to help improve symptoms of this condition. An eye disease that leads to vision loss in older adults (age-related macular degeneration or AMD). Taking zinc by mouth, especially with antioxidant vitamins, might help slow vision loss and prevent age-related vision loss from becoming advanced in people at high risk. Attention deficit-hyperactivity disorder (ADHD). In children, taking zinc by mouth along with medicine for ADHD might help reduce certain ADHD symptoms. Child growth. Taking zinc by mouth during pregnancy seems to help improve the growth of the infant during the first year of life. In children, taking zinc by mouth might modestly improve growth. Common cold. Sucking on lozenges containing zinc gluconate or zinc acetate helps shorten the length of a cold in adults. But it's not clear if zinc helps to prevent colds. Coronavirus disease 2019 (COVID-19). Taking zinc by mouth or giving zinc by IV might lower the chance of death in people admitted to the hospital for COVID-19. But taking zinc by mouth doesn't seem to speed up recovery from COVID-19 in people who haven't been admitted to the hospital. Depression. Taking zinc by mouth along with antidepressants seems to improve depression. It might also help in people who don't respond to treatment with antidepressants alone. Diabetes. Taking zinc by mouth might help to improve blood sugar control by a small amount in people with diabetes. Diaper rash. Giving zinc gluconate by mouth to infants seems to help heal diaper rash. Applying zinc oxide paste also seems to help. But it doesn't seem to work as well as applying 2% eosin solution. A mild form of gum disease (gingivitis). Using toothpastes containing zinc, with or without an antibacterial agent, seems to help prevent gingivitis. Bad breath. Chewing gum, sucking on a candy, or using a mouth rinse containing zinc reduces bad breath. Cold sores (herpes labialis). Applying zinc sulfate or zinc oxide to the skin, alone or with other ingredients, seems to reduce the duration and severity of cold sores. Reduced ability to taste (hypogeusia). Taking zinc by mouth improves the ability to taste foods in most people who have this condition. Skin infection caused by Leishmania parasites (Leishmania lesions). Taking zinc sulfate by mouth or injecting as a solution into lesions helps heal lesions in people with this condition. But it doesn't seem to work as well as conventional treatments. Injections should only be given by a healthcare provider. Leprosy. Taking zinc by mouth in combination with anti-leprosy drugs seems to help treat leprosy. Infants born weighing less than 2500 grams (5 pounds, 8 ounces). Giving oral zinc to these infants seems to help increase weight and height. But taking zinc while pregnant does not seem to help increase infant weight at birth. Stomach ulcers. Taking zinc acexamate by mouth seems to help treat and prevent stomach ulcers. Pneumonia. Taking zinc by mouth might help prevent pneumonia in some children. But it doesn't seem to help children who already have pneumonia. Growth and development in premature infants. Giving oral zinc to these infants seems to help increase weight and height. Bed sores (pressure ulcers). Applying zinc paste to the skin appears to help heal bed sores. Taking zinc by mouth along with vitamin C and arginine might also help. Sickle cell disease. Taking zinc by mouth seems to help reduce symptoms of sickle cell disease in people with zinc deficiency. Warts. Applying a zinc ointment appears to be as effective as conventional treatments for curing warts. Taking zinc sulfate by mouth also appears to help. Possibly ineffective for...: Patchy hair loss (alopecia areata). Taking zinc by mouth doesn't seem to help with hair loss. Cystic fibrosis. Taking zinc by mouth doesn't improve lung function in children or adolescents with cystic fibrosis. HIV/AIDS. Taking zinc by mouth doesn't improve immune function or reduce the risk of death in people with HIV. Pregnancy complications in people with HIV/AIDS. Taking zinc by mouth during pregnancy does not appear to reduce the risk of transmitting HIV to the infant or prevent other complications. Involuntary weight loss in people with HIV/AIDS. Taking zinc by mouth does not appear to prevent diarrhea or death in people with this condition. Infant development. Giving zinc by mouth to infants or children at risk for having low levels of zinc doesn't seem to improve development. But taking zinc by mouth during pregnancy might increase the growth of the child during the first year of life. Long-term swelling (inflammation) in the digestive tract (inflammatory bowel disease or IBD). Taking zinc by mouth does not seem to help treat IBD. Flu (influenza). Taking zinc by mouth doesn't seem to improve immune function against the flu. Ear infection (otitis media). Taking zinc by mouth doesn't seem to prevent ear infections in children. A pregnancy complication marked by high blood pressure and protein in the urine (pre-eclampsia). Taking zinc does not seem to reduce the risk of high blood pressure in pregnancy. Prostate cancer. Taking zinc by mouth does not seem to reduce the risk of getting prostate cancer. Scaly, itchy skin (psoriasis). Taking zinc by mouth does not seem to help treat psoriasis. Rheumatoid arthritis (RA). Taking zinc by mouth does not seem to help treat rheumatoid arthritis. Sexual problems that prevent satisfaction during sexual activity. Taking zinc by mouth does not improve sexual function in males with sexual dysfunction related to kidney disease. Ringing in the ears (tinnitus). Taking zinc by mouth does not seem to help treat ringing in the ears. Likely ineffective for...: Malaria. Taking zinc by mouth does not help prevent or treat malaria in undernourished children in developing countries or pregnant adults. Is it safe?: When taken by mouth : Zinc is likely safe when used in amounts no greater than 40 mg daily. It is possibly safe when taken in larger doses, especially when used only for a short period of time. But taking doses higher than 40 mg daily might decrease how much copper the body absorbs. Taking very high doses of zinc is likely unsafe and might cause stomach pain, vomiting, and many other problems. Single doses of 10-30 grams of zinc can be fatal. When applied to the skin : Zinc is likely safe. Using zinc on broken skin may cause burning, stinging, itching, and tingling. When inhaled : Zinc is possibly unsafe when inhaled through the nose. It might cause permanent loss of smell. Avoid using nose sprays containing zinc. Special precautions & warnings: Pregnancy : Zinc is likely safe when used in the recommended amounts while pregnant. But it is likely unsafe when used in high doses. Those over 18 should not take more than 40 mg of zinc daily, and those 14-18 years old should not take more than 34 mg daily while pregnant. Breast-feeding : Zinc is likely safe when used in the recommended amounts while breast-feeding. But zinc is possibly unsafe when used in high doses. Those over 18 years old should not take more than 40 mg of zinc daily, and those 14-18 years old should not take more than 34 mg daily while breast-feeding. Children : Zinc is likely safe when taken by mouth appropriately in recommended amounts. Daily doses of zinc should not exceed 4 mg daily in infants 0-6 months old, 5 mg daily in infants 7-12 months old, 7 mg daily in children 1-3 years old, 12 mg daily in children 4-8 years old, 23 mg daily in children 9-13 years old, and 34 mg daily in those 14-18 years old. In infants, it is possibly unsafe to apply topical zinc to broken skin. The zinc can be absorbed through the breaks in the skin and cause serious adverse effects. Alcohol use disorder : Long-term, excessive alcohol use may reduce the body's ability to absorb zinc. Surgery for weight-loss (bariatric surgery) : Bariatric surgery reduces the absorption of zinc and might increase the risk for zinc deficiency. Zinc levels may need to be monitored. Copper deficiency : Taking excess zinc can lead to copper deficiency. People with pre-existing copper deficiency or risk factors for copper deficiency such as malnutrition or gastrointestinal surgery may be at higher risk. Kidney disease : Low intake of zinc in the diet might increase the risk of getting kidney disease. Also, people with kidney disease who are on hemodialysis are at risk for zinc deficiency and might require zinc supplements. Vegetarianism : Vegetarian diets are often linked with lower zinc absorption. But the body adapts over time. It becomes better at absorbing zinc and reducing zinc loss. Are there interactions with medications?: Moderate: Be cautious with this combination. Antibiotics (Quinolone antibiotics): Zinc might decrease how much antibiotic the body absorbs from the gut. Taking zinc along with quinolone antibiotics might decrease the effects of these antibiotics. To avoid this interaction, take antibiotics at least 2 hours before or 4-6 hours after zinc supplements. Antibiotics (Tetracycline antibiotics): Zinc can decrease the amount of tetracyclines the body absorbs. Taking zinc with tetracyclines might decrease the effects of tetracyclines. To avoid this interaction, take tetracyclines 2 hours before or 4-6 hours after taking zinc supplements. Cephalexin (Keflex): Zinc can reduce how much cephalexin the body absorbs. This might decrease how well cephalexin works for treating infections. To avoid this interaction, take zinc 3 hours after taking cephalexin. Cisplatin (Platinol-AQ): Cisplatin is used to treat cancer. Taking zinc along with cisplatin might inactivate cisplatin therapy. But it's not clear if this is a big concern. Medications for HIV/AIDS (Integrase inhibitors): Taking zinc along with integrase inhibitors might decrease blood levels of integrase inhibitors. This might decrease the effects of these medications. Talk to your healthcare provider if you are using integrase inhibitors and want to start taking zinc. Penicillamine (Cuprimine, Depen): Zinc might decrease how much penicillamine the body absorbs. Taking zinc with penicillamine might decrease the effects of penicillamine. Take zinc and penicillamine at least 2 hours apart. Ritonavir (Norvir): Ritonavir is a drug used for HIV infection. Zinc can reduce how much ritonavir the body absorbs. But it isn't clear if this is a big concern. Minor: Be watchful with this combination. Amiloride (Midamor): Amiloride can increase the amount of zinc in the body. Taking zinc supplements with amiloride might increase zinc levels. But this isn't likely to be a big concern for most people. Atazanavir (Reyataz): Atazanavir is a drug used for HIV infection. Zinc decreases how much atazanavir the body absorbs. But the body still absorbs enough atazanavir for it to work for treating HIV. So this interaction is probably not a big concern. Are there interactions with herbs and supplements?: Beta-carotene: High doses of zinc can lower beta-carotene blood levels. Bromelain: Zinc might reduce the effects of bromelain. But this isn't likely to be a big concern. Calcium: Calcium supplements might decrease how much zinc the body absorbs from food. This usually doesn't seem to be much of a problem. But this interaction can be avoided by taking calcium supplements at bedtime instead of with meals. Chromium: Taking chromium and zinc together can reduce the absorption of both chromium and zinc. This is probably not a big concern with usual doses of zinc and chromium. Coffee: Taking zinc with coffee can reduce how much zinc the body absorbs. Copper: Large amounts of zinc can reduce copper absorption. Taking zinc in high doses can cause copper deficiency and anemia. Some signs of copper deficiency have also occurred in people taking zinc in doses of 150 mg daily or more for 2 years. EDTA: EDTA is a chemical compound that is given to people to remove excess metals from the body, especially lead. Repeated high doses of EDTA, as used in chelation treatment, can reduce blood zinc levels by up to 40%. People receiving chelation therapy should be monitored for zinc deficiency. Folic acid: Folic acid supplements can change the absorption of zinc from food. But normal supplemental doses of folic acid are not likely to affect zinc levels in people with adequate dietary zinc intake. IP-6 (Phytic acid): Phytic acid found naturally in foods can bind zinc and reduce how much is absorbed by the body. Avoid IP-6 supplements, which contain phytic acid, if you have other risk factors for zinc deficiency. Iron: Iron and zinc can interfere with each other's absorption. To avoid this effect, take these supplements with food. Magnesium: High doses of zinc supplements (142 mg/day), or high zinc intake from foods (53mg/day), seems to decrease magnesium levels. But it isn't clear if this is a big concern. Manganese: Research suggests zinc supplements can increase the amount of manganese absorbed from supplements. Riboflavin (Vitamin B2): Research suggests riboflavin can improve zinc absorption. The importance of this isn't known. Vitamin A: Zinc supplements can increase blood levels of vitamin A. Zinc might increase the effects and side effects of vitamin A. Vitamin D: Vitamin D is involved in zinc absorption, but it's not clear whether vitamin D improves zinc absorption. Are there interactions with foods?: Taking zinc with coffee can reduce how much zinc the body absorbs.Eating foods containing fiber and phytates, which are chemicals found in grains such as maize, corn, and sorghum, can also reduce how much zinc the body absorbs. But the body usually adapts over time. Eating animal protein can increase zinc absorption, while plant proteins such as soy might reduce absorption. How is it typically used?: Zinc is an essential nutrient found in foods such as red meat, poultry, and fish. The amount that should be consumed on a daily basis is called the recommended dietary allowance (RDA). For females 18 years of age the RDA is 9 mg, and for females 19 years and older the RDA is 8 mg. For males 18 years and older the RDA is 11 mg. While pregnant, the RDA is 13 mg in those 18 years of age and 11 mg in those 19 years and older. While breast-feeding, the RDA is 17 mg in those 18 years of age and 12 mg in those 19 years and older. In children, the RDA depends on age. Zinc is also available in supplements, lotions, gels, ointments, mouth rinses, and many other products. Speak with a healthcare provider to find out what type of product and dose might be best for a specific condition."
    },
    {
      "title": "Glucosamine",
      "link": "https://medlineplus.gov/druginfo/natural/807.html",
      "source": "MedlinePlus",
      "date": "11/11/2024",
      "content": "What is it?: Glucosamine is a chemical found in the body. Glucosamine supplements are sold as glucosamine sulfate, glucosamine hydrochloride, and N-acetyl glucosamine. Glucosamine is used by the body to make other chemicals that build tendons, ligaments, cartilage, and the fluid that surrounds joints. Joints are cushioned by the fluid and cartilage around them. Taking glucosamine might increase the cartilage and fluid around joints and/or help prevent their breakdown. People commonly use glucosamine sulfate and glucosamine hydrochloride for osteoarthritis. Glucosamine is also used for joint pain, rheumatoid arthritis, multiple sclerosis, and many other conditions, but there is no good scientific evidence to support these other uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for GLUCOSAMINE are as follows: There is interest in using glucosamine for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Likely effective for...: Osteoarthritis. Taking glucosamine sulfate by mouth for at least 4 weeks can provide some pain relief and improve function for people with knee osteoarthritis. Products that contain glucosamine hydrochloride do not seem to work as well unless they are taken in combination with other ingredients. Taking glucosamine sulfate doesn't seem to reduce the risk of getting osteoarthritis. Is it safe?: When taken by mouth : Glucosamine sulfate is likely safe in most adults when used for up to 3 years. Glucosamine hydrochloride is possibly safe for most adults when used for up to 2 years. N-acetyl glucosamine is also possibly safe when used for up to 6 months. Glucosamine can cause some mild side effects including bloating, nausea, diarrhea, and constipation. When applied to the skin : N-acetyl glucosamine is possibly safe when used for up to 10 weeks. When given as an enema (rectally) : N-acetyl glucosamine is possibly safe when used in doses of 3-4 grams daily. Special precautions & warnings: Pregnancy and breast-feeding : There isn't enough reliable information to know if glucosamine sulfate, glucosamine hydrochloride, or N-acetyl glucosamine is safe to use when pregnant or breast-feeding. Stay on the safe side and avoid use. Asthma : Glucosamine might make asthma worse. Until more is known, people with asthma should be cautious about taking products that contain glucosamine. Diabetes : There used to be some concern that glucosamine might increase blood sugar levels. But most research shows that glucosamine doesn't increase blood sugar levels in people with diabetes. Glaucoma : Glucosamine might increase the pressure inside the eye and could worsen glaucoma. If you have glaucoma, talk to your healthcare provider before taking glucosamine. High cholesterol : There used to be some concern that glucosamine might increase cholesterol levels. But most research shows that glucosamine doesn't seem to increase cholesterol levels. High blood pressure : There used to be some concern that glucosamine might increase blood pressure. But most research shows that glucosamine does not seem to increase blood pressure. Shellfish allergy : Glucosamine is produced from the shells of shrimp, lobster, and crabs. If you have a shellfish allergy, talk to your healthcare provider before using glucosamine. Are there interactions with medications?: Major: Do not take this combination. Warfarin (Coumadin): Warfarin is used to slow blood clotting. Taking glucosamine with or without chondroitin increases the effects of warfarin. This can increase the risk for serious bruising and bleeding. Don't take glucosamine if you are taking warfarin. Moderate: Be cautious with this combination. Medications for cancer (Topoisomerase II Inhibitors): Some medications for cancer work by decreasing how fast cancer cells can copy themselves. Glucosamine might block these medications from working. Taking glucosamine along with some medications for cancer might decrease the effectiveness of these medications. Minor: Be watchful with this combination. Acetaminophen (Tylenol, others): Taking glucosamine SULFATE and acetaminophen together might affect how well each works. But more information is needed to know if this interaction is a big concern. Medications for diabetes (Antidiabetes drugs): Glucosamine might increase blood sugar levels. Taking glucosamine along with diabetes medications might reduce the effects of these medications. Monitor your blood sugar closely. Are there interactions with herbs and supplements?: Chondroitin sulfate: Taking chondroitin sulfate together with glucosamine HYDROCHLORIDE might reduce blood levels of glucosamine hydrochloride. But it's not clear if this will change the effects of glucosamine hydrochloride. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Glucosamine sulfate and glucosamine hydrochloride have most often been used by adults in doses of 1500 mg by mouth daily for up to 3 years. Speak with a healthcare provider to find out what dose might be best for a specific condition. Keep in mind that glucosamine used in supplements often comes from the shells of shellfish. Talk to your healthcare provider before taking these supplements if you have a shellfish allergy. Also, some glucosamine products aren't labeled correctly. In some cases, the amount of glucosamine actually in the product has varied from none to over 100% of the amount stated on the product's label. Some products have contained glucosamine hydrochloride when glucosamine sulfate was listed on the label."
    },
    {
      "title": "Ashwagandha",
      "link": "https://medlineplus.gov/druginfo/natural/953.html",
      "source": "MedlinePlus",
      "date": "30/12/2024",
      "content": "What is it?: Ashwagandha is an evergreen shrub that grows in Asia and Africa. It is commonly used for stress. There is little evidence for its use as an \"adaptogen.\" Ashwagandha contains chemicals that might help calm the brain, reduce swelling, lower blood pressure, and alter the immune system. People commonly use ashwagandha for anxiety, insomnia, and stress. It is also used for asthma, athletic performance, back pain, and many other conditions, but there is no good scientific evidence to support most of these uses. There is also no good evidence to support using ashwagandha for COVID-19. Don't confuse ashwagandha with Physalis alkekengi. Both are known as winter cherry. Also, don't confuse ashwagandha with American ginseng, Panax ginseng, or eleuthero. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for ASHWAGANDHA are as follows: There is interest in using ashwagandha for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Anxiety. Taking ashwagandha by mouth might reduce anxiety. A type of persistent anxiety marked by exaggerated worry and tension (generalized anxiety disorder or GAD). Taking ashwagandha by mouth seems to improve anxiety in people with persistent anxiety. Insomnia. Taking ashwagandha by mouth seems to improve overall sleep and sleep quality in some people. Stress. Taking ashwagandha by mouth seems to help reduce stress in some people. It might also help reduce stress-related weight gain. Is it safe?: When taken by mouth : Ashwagandha is possibly safe when used for up to 3 months. The long-term safety of ashwagandha is not known. Large doses of ashwagandha might cause stomach upset, diarrhea, and vomiting. Rarely, liver problems, including severe liver failure and a need for liver transplantation, might occur. When applied to the skin : Lotion containing ashwagandha is possibly safe when used for up to 2 months. Special precautions & warnings: Pregnancy : It is likely unsafe to use ashwagandha when pregnant. There is some evidence that ashwagandha might cause miscarriages. Breast-feeding : There isn't enough reliable information to know if ashwagandha is safe to use when breast-feeding. Stay on the safe side and avoid use. \"Auto-immune diseases\" such as multiple sclerosis (MS), lupus (systemic lupus erythematosus, SLE), rheumatoid arthritis (RA), or other conditions : Ashwagandha might cause the immune system to become more active, and this could increase the symptoms of auto-immune diseases. If you have one of these conditions, it's best to avoid using ashwagandha. Liver disease : Ashwagandha might cause liver damage in some people. But it isn't clear how often this occurs. Until more is known, people with liver disease should avoid taking ashwagandha. Surgery : Ashwagandha may slow down the central nervous system. Healthcare providers worry that anesthesia and other medications during and after surgery might increase this effect. Stop taking ashwagandha at least 2 weeks before a scheduled surgery. Thyroid disorders : Ashwagandha might increase thyroid hormone levels. Ashwagandha should be used cautiously or avoided if you have a thyroid condition or take thyroid hormone medications. Are there interactions with medications?: Moderate: Be cautious with this combination. Medications for diabetes (Antidiabetes drugs): Ashwagandha might lower blood sugar levels. Taking ashwagandha along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Medications for high blood pressure (Antihypertensive drugs): Ashwagandha might lower blood pressure. Taking ashwagandha along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications that can harm the liver (Hepatotoxic drugs): Ashwagandha might harm the liver. Some medications can also harm the liver. Taking ashwagandha along with a medication that can harm the liver might increase the risk of liver damage. Medications that decrease the immune system (Immunosuppressants): Ashwagandha can increase the activity of the immune system. Some medications, such as those used after a transplant, decrease the activity of the immune system. Taking ashwagandha along with these medications might decrease the effects of these medications. Sedative medications (Benzodiazepines): Ashwagandha might cause sleepiness and slowed breathing. Some medications, called sedatives, can also cause sleepiness and slowed breathing. Taking ashwagandha with sedative medications might cause breathing problems and/or too much sleepiness. Sedative medications (CNS depressants): Ashwagandha might cause sleepiness and slowed breathing. Some medications, called sedatives, can also cause sleepiness and slowed breathing. Taking ashwagandha with sedative medications might cause breathing problems and/or too much sleepiness. Thyroid hormone: The body naturally produces thyroid hormones. Ashwagandha might increase how much thyroid hormone the body produces. Taking ashwagandha with thyroid hormone pills might cause too much thyroid hormone in the body, and increase the effects and side effects of thyroid hormone. Minor: Be watchful with this combination. Medications changed by the liver (Cytochrome P450 1A2 (CYP1A2) substrates): Some medications are changed and broken down by the liver. Ashwagandha might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 3A4 (CYP3A4) substrates): Some medications are changed and broken down by the liver. Ashwagandha might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Are there interactions with herbs and supplements?: Herbs and supplements that might harm the liver: Ashwagandha might harm the liver. Taking it with other supplements that can also harm the liver might increase the risk of liver damage. Examples of supplements with this effect include garcinia, greater celandine, green tea extract, kava, and kratom. Herbs and supplements that might lower blood pressure: Ashwagandha might lower blood pressure. Taking it with other supplements that have the same effect might cause blood pressure to drop too much. Examples of supplements with this effect include andrographis, casein peptides, L-arginine, niacin, and stinging nettle. Herbs and supplements with sedative properties: Ashwagandha might cause sleepiness and slowed breathing. Taking it along with other supplements with similar effects might cause too much sleepiness and/or slowed breathing in some people. Examples of supplements with this effect include hops, kava, L-tryptophan, melatonin, and valerian. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Ashwagandha has most often been used by adults in doses up to 1000 mg daily, for up to 12 weeks. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Resveratrol",
      "link": "https://medlineplus.gov/druginfo/natural/307.html",
      "source": "MedlinePlus",
      "date": "30/01/2025",
      "content": "What is it?: Resveratrol is a chemical mostly found in red grapes and products made from these grapes (wine, juice). It may be helpful for hay fever and weight loss. Resveratrol might have many effects in the body, including expanding blood vessels and reducing blood clotting. It may also decrease pain and swelling, reduce levels of sugar in the blood, and help the body fight against disease. Resveratrol is most commonly used for high cholesterol, cancer, heart disease, and many other conditions. But there is no strong evidence to support resveratrol for any use. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for RESVERATROL are as follows: There is interest in using resveratrol for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Hay fever. Using a nasal spray containing resveratrol three times daily for 4 weeks seems to reduce allergy symptoms in adults with seasonal allergies. Using a nasal spray containing resveratrol and beta-glucans three times daily for 2 months also seems to reduce allergy symptoms in children with seasonal allergies. Obesity. Taking resveratrol by mouth seems to increase weight loss in overweight and obese adults. But it doesn't seem to improve blood pressure, glucose control, or levels of cholesterol and other fats. Possibly ineffective for...: Heart disease. People who consume higher amounts of dietary resveratrol do not seem to have a lower risk of heart disease compared to people who consume lower amounts. Also, taking resveratrol by mouth does not seem to improve levels of cholesterol or blood fats called triglycerides in people at risk for heart disease. High cholesterol. Taking resveratrol by mouth does not seem to improve levels of cholesterol or blood fats called triglycerides. A grouping of symptoms that increase the risk of diabetes, heart disease, and stroke (metabolic syndrome). Taking resveratrol by mouth doesn't seem to lower blood pressure, blood sugar, or cholesterol in people with metabolic syndrome. Build up of fat in the liver in people who drink little or no alcohol (nonalcoholic fatty liver disease or NAFLD). Taking resveratrol by mouth doesn't seem to improve liver function, liver scarring, or cholesterol levels in people with NAFLD. Is it safe?: When taken by mouth : People often consume resveratrol in small amounts in foods. Resveratrol supplements are possibly safe when taken by mouth in doses up to 1500 mg daily for up to 3 months. Higher doses of up to 2000-3000 mg daily have been used safely for 2-6 months. But these higher doses are more likely to cause stomach upset. When applied to the skin : Resveratrol is possibly safe when used for up to 30 days. When sprayed into the nose : Resveratrol is possibly safe when used for up to 4 weeks. Special precautions & warnings: Pregnancy and breast-feeding : Resveratrol is likely safe when used in amounts found in some foods. However, during pregnancy and breast-feeding, the source of resveratrol is important. Resveratrol is found in grape skins, grape juice, wine, and other food sources. Wine should not be used as a source of resveratrol when pregnant or breast-feeding. Children : People often consume resveratrol in small amounts in foods. But there isn't enough reliable information to know if it safe to take by mouth in larger amounts. Resveratrol is possibly safe in children when sprayed in the nose for up to 2 months. Bleeding disorders : Resveratrol might slow blood clotting and increase the risk of bleeding in people with bleeding disorders. Hormone-sensitive condition such as breast cancer, uterine cancer, ovarian cancer, endometriosis, or uterine fibroids : Resveratrol might act like estrogen. If you have any condition that might be made worse by exposure to estrogen, don't use resveratrol. Surgery : Resveratrol might increase the risk of bleeding during and after surgery. Stop using resveratrol at least 2 weeks before a scheduled surgery. Are there interactions with medications?: Moderate: Be cautious with this combination. Medications changed by the liver (Cytochrome P450 1A1 (CYP1A1) substrates): Some medications are changed and broken down by the liver. Resveratrol might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 1A2 (CYP1A2) substrates): Some medications are changed and broken down by the liver. Resveratrol might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 1B1 (CYP1B1) substrates): Some medications are changed and broken down by the liver. Resveratrol might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 2C19 (CYP2C19) substrates): Some medications are changed and broken down by the liver. Resveratrol might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 2E1 (CYP2E1) substrates): Some medications are changed and broken down by the liver. Resveratrol might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 3A4 (CYP3A4) substrates): Some medications are changed and broken down by the liver. Resveratrol might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): Resveratrol might slow blood clotting. Taking resveratrol along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Are there interactions with herbs and supplements?: Herbs and supplements that might slow blood clotting: Resveratrol might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Are there interactions with foods?: Resveratrol can be taken with or without food. But taking resveratrol with fatty foods might reduce how much the body absorbs. How is it typically used?: Resveratrol has most often been used by adults in doses of 250-1000 mg by mouth daily for up to 3 months. It is also sometimes used in nasal sprays. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Melatonin",
      "link": "https://medlineplus.gov/druginfo/natural/940.html",
      "source": "MedlinePlus",
      "date": "09/07/2024",
      "content": "What is it?: Melatonin is a hormone made in the body. It regulates night and day cycles or sleep-wake cycles. Melatonin in supplements is usually made in a lab. Darkness triggers the body to make more melatonin, which signals the body to sleep. Light decreases melatonin production and signals the body to be awake. Some people who have trouble sleeping have low levels of melatonin. It's thought that adding melatonin from supplements might help them sleep. People most commonly use melatonin for insomnia and improving sleep in different conditions, such as jet lag. It is also used for depression, chronic pain, dementia, and many other conditions, but there is no good scientific evidence to support most of these uses. There is also no good evidence to support using melatonin for COVID-19. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for MELATONIN are as follows: There is interest in using melatonin for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Likely effective for...: Trouble falling asleep at a conventional bedtime (delayed sleep phase syndrome). Taking melatonin by mouth seems to shorten the time needed to fall asleep in young adults and children with this condition. Non-24-hour sleep wake disorder. Taking melatonin by mouth at bedtime seems to improve sleep in children and adults who are blind. Possibly effective for...: Sleep disturbance caused by certain blood pressure medicine (beta blocker-induced insomnia). Taking melatonin by mouth might reduce sleep problems in people taking beta-blocker drugs. Cancer. Taking high doses of melatonin by mouth or as a shot, administered by a healthcare provider along with chemotherapy or other cancer treatments, might reduce tumor size and improve survival rates in some people with cancer. Confusion and agitation after surgery. In children receiving a medication called sevoflurane during surgery, taking melatonin by mouth before anesthesia might help to prevent anxiety and agitation while waking up. The effect of taking melatonin in adults undergoing surgery is unclear. High blood pressure. Taking the controlled-release form of melatonin by mouth before bedtime seems to lower blood pressure in people with high blood pressure. Immediate-release products don't seem to work. Insomnia. Taking melatonin by mouth, short-term, seems to shorten the time it takes to fall asleep in people with insomnia, but only by about 7-12 minutes. It's not clear if it affects the amount of time spent sleeping. It also seems to be more helpful in older adults and those with certain other conditions. Jet lag. Taking melatonin by mouth can improve certain symptoms of jet lag such as alertness and reduce daytime sleepiness and tiredness. But it might not help shorten the time it takes for people with jet lag to fall asleep. Migraine. Taking melatonin by mouth before bed can prevent migraines in adults and children. It's not clear if melatonin helps to treat migraines. Anxiety before a procedure. Taking melatonin by mouth or under the tongue somewhat reduces anxiety before surgery in adults. It's not clear if it helps in children. Sedation before a procedure. Taking melatonin by mouth might reduce the amount of sedatives needed for some medical procedures in children. Sunburn. Applying melatonin gel to the skin before sun exposure seems to help prevent sunburn. A group of painful conditions that affect the jaw joint and muscle (temporomandibular disorders or TMD). Taking melatonin by mouth at bedtime for 4 weeks reduces pain in females with jaw pain. Low levels of platelets in the blood (thrombocytopenia). Taking melatonin by mouth can improve low blood platelet counts associated with cancer, cancer treatment, and other disorders. Possibly ineffective for...: Athletic performance. Taking melatonin by mouth shortly before resistance exercise or cycling doesn't appear to improve performance. Involuntary weight loss in people who are very ill (cachexia or wasting syndrome). Taking melatonin by mouth doesn't improve appetite, body weight, or body composition in people with wasting syndrome from cancer. Tiredness in people with cancer. Taking melatonin by mouth doesn't seem to improve tiredness in people with cancer. Pain in people with cancer. Taking melatonin by mouth doesn't seem to reduce pain in people with cancer. Critical illness (trauma). Taking melatonin by mouth doesn't seem to shorten hospital stay in people that are critically ill. Diseases, such as Alzheimer disease, that interfere with thinking (dementia). Taking melatonin by mouth doesn't improve behavior or affect symptoms in people with Alzheimer disease or other forms of memory loss. But it might reduce confusion when the sun goes down in people with these conditions. Inability to become pregnant within a year of trying to conceive (infertility). Taking melatonin by mouth doesn't seem to improve pregnancy rates in females undergoing fertility treatments. Sleep disorder due to rotating or night shifts (shift work disorder). Taking melatonin by mouth doesn't seem to improve sleeping problems in people who do shift work. Likely ineffective for...: Withdrawal from drugs called benzodiazepines. Taking melatonin by mouth at bedtime doesn't reduce withdrawal symptoms in people with insomnia who have stopped taking these drugs. Depression. Taking melatonin by mouth doesn't seem to reduce symptoms of depression, and might make symptoms worse in some people. Is it safe?: When taken by mouth : Melatonin is likely safe for most adults when used short-term. Melatonin is possibly safe when taken long-term. It's been used safely for up to 2 years. But it can cause some side effects including headache, sleepiness, dizziness, and nausea. Don't drive or use machinery for 4-5 hours after taking melatonin. When applied to the skin : Melatonin is likely safe for most adults when used short-term. Special precautions & warnings: Pregnancy : Melatonin is possibly unsafe when regularly taken by mouth or in high doses while trying to become pregnant. Melatonin might have effects similar to birth control, making it more difficult to become pregnant. There isn't enough reliable information to know if melatonin is safe to use when pregnant. Until more is known, it's best not to use melatonin while pregnant or trying to become pregnant. Breast-feeding : There isn't enough reliable information to know if melatonin is safe to use when breast-feeding. Stay on the safe side and avoid use. Children : Melatonin is possibly safe when taken by mouth, short-term. Melatonin is usually well tolerated when taken in doses up to 3 mg daily in children and 5 mg daily in adolescents. There is some concern that melatonin might interfere with development during adolescence. Melatonin should only be used in children with a medical need. There isn't enough evidence to know if melatonin is safe in children when taken by mouth, long-term. Bleeding disorders : Melatonin might make bleeding worse in people with bleeding disorders. Depression : Melatonin can make symptoms of depression worse. High blood pressure : Melatonin can raise blood pressure in people who are taking certain medications to control blood pressure. Avoid using it. Seizure disorders : Using melatonin might increase the risk of having a seizure. Transplant recipients : People who have had a transplant often take medications to suppress the immune system. Melatonin can increase immune function. This might interfere with the effects of some transplant medications. Are there interactions with medications?: Moderate: Be cautious with this combination. Birth control pills (Contraceptive drugs): Birth control pills seem to increase how much melatonin the body makes. Taking melatonin along with birth control pills might increase the effects and side effects of melatonin. Caffeine: Caffeine might increase or decrease melatonin levels in the body. When taken together with melatonin supplements, caffeine seems to increase melatonin levels. Fluvoxamine (Luvox): Taking fluvoxamine can increase the amount of melatonin that the body absorbs. Taking melatonin along with fluvoxamine might increase the effects and side effects of melatonin. Medications changed by the liver (Cytochrome P450 1A2 (CYP1A2) substrates): Some medications are changed and broken down by the liver. Melatonin might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 2C19 (CYP2C19) substrates): Some medications are changed and broken down by the liver. Melatonin might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications for diabetes (Antidiabetes drugs): Melatonin might lower blood sugar levels. Taking melatonin along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Medications for high blood pressure (Antihypertensive drugs): Melatonin might lower blood pressure. Taking melatonin along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications that decrease the immune system (Immunosuppressants): Melatonin can increase the activity of the immune system. Some medications, such as those used after a transplant, decrease the activity of the immune system. Taking melatonin along with these medications might decrease the effects of these medications. Medications that increase the chance of having a seizure (Seizure threshold lowering drugs): Melatonin might increase the risk of seizures in some people. There are also some medications that can increase the risk of seizures. Taking these products together might increase the risk of a seizure even more. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): Melatonin might slow blood clotting. Taking melatonin along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Medications used to prevent seizures (Anticonvulsants): Melatonin may increase the risk of seizures. Therefore, taking melatonin may decrease the effects of medications used to prevent seizures. This might increase the risk of seizures. Methamphetamine (Desoxyn): Taking melatonin with methamphetamine might increase the effects and side effects of methamphetamine. Nifedipine GITS (Procardia XL): Nifedipine GITS is used to lower blood pressure. Taking melatonin might decrease the effects of nifedipine GITS for lowering blood pressure. Sedative medications (CNS depressants): Melatonin might cause sleepiness and slowed breathing. Some medications, called sedatives, can also cause sleepiness and slowed breathing. Taking melatonin with sedative medications might cause breathing problems and/or too much sleepiness. Warfarin (Coumadin): Warfarin is used to slow blood clotting. Melatonin might increase the effectiveness of warfarin. Taking melatonin along with warfarin might increase the chances of bruising and bleeding. Be sure to have your blood checked regularly. The dose of your warfarin might need to be changed. Minor: Be watchful with this combination. Flumazenil (Romazicon): Flumazenil might decrease the effects of melatonin. Taking flumazenil along with melatonin might decrease the effects of melatonin supplements. Medications changed by the liver (Cytochrome P450 2D6 (CYP2D6) substrates): Some medications are changed and broken down by the liver. Melatonin might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 3A4 (CYP3A4) substrates): Some medications are changed and broken down by the liver. Melatonin might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Are there interactions with herbs and supplements?: Caffeine: Caffeine might increase or decrease melatonin levels in the body. When taken together with melatonin supplements, caffeine seems to increase melatonin levels. Herbs and supplements that might lower blood pressure: Melatonin might lower blood pressure. Taking it with other supplements that have the same effect might cause blood pressure to drop too much. Examples of supplements with this effect include andrographis, casein peptides, L-arginine, niacin, and stinging nettle. Herbs and supplements that might lower blood sugar: Melatonin might lower blood sugar. Taking it with other supplements with similar effects might lower blood sugar too much. Examples of supplements with this effect include aloe, bitter melon, cassia cinnamon, chromium, and prickly pear cactus. Herbs and supplements that might lower seizure threshold: Melatonin might increase the risk for seizures. Taking it along with other supplements with similar effects might increase the risk for seizures even more. Examples of supplements with this effect include caffeine, evening primrose, L-carnitine, melatonin, and sage. Herbs and supplements that might slow blood clotting: Melatonin might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Herbs and supplements with sedative properties: Melatonin might cause sleepiness and slowed breathing. Taking it along with other supplements with similar effects might cause too much sleepiness and/or slowed breathing in some people. Examples of supplements with this effect include hops, kava, L-tryptophan, and valerian. Vitex agnus-castus: Taking vitex agnus-castus increases melatonin levels in the body. Taking vitex agnus-castus with melatonin might increase the effects and side effects of melatonin. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Melatonin has most often been used by adults in doses up to 8 mg by mouth daily for up to 6 months. In children, it's most often been used in doses up to 3 mg by mouth daily for up to 3 months. Some melatonin supplements are slow-release and others are fast-release. Some melatonin products can be placed under the tongue or in the cheek to absorb faster. Melatonin is also used in creams, gargles, and gels. Speak with a healthcare provider to find out what type of product and dose might be best for a specific condition."
    },
    {
      "title": "Biotin",
      "link": "https://medlineplus.gov/druginfo/natural/313.html",
      "source": "MedlinePlus",
      "date": "11/11/2024",
      "content": "What is it?: Biotin (vitamin B7) is a vitamin found in foods like eggs, milk, and bananas. Biotin deficiency can cause thinning of the hair and a rash on the face. Biotin is an important part of enzymes in the body that break down substances like fats, carbohydrates, and others. There isn't a good test for detecting low biotin levels, so it's usually identified by its symptoms, which include thinning hair and red scaly rash around the eyes, nose, and mouth. Biotin is used for biotin deficiency. It is also commonly used for hair loss, brittle nails, and other conditions, but there is no good scientific evidence to support these uses. Biotin supplements might interfere with some lab tests. Talk with your doctor if you are taking biotin supplements and need to have any blood tests. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for BIOTIN are as follows: There is interest in using biotin for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Likely effective for...: Biotin deficiency. Taking biotin by mouth or by a shot can treat and prevent low blood levels of biotin. Up to 10 mg of biotin by mouth daily has been used to treat and prevent deficiency. A biotin shot can only be given by a healthcare provider. Possibly ineffective for...: Multiple sclerosis (MS). Taking high-dose biotin by mouth does not reduce disability in people with MS. It also doesn't seem to affect the risk for relapse. Rough, scaly skin on the scalp and face (seborrheic dermatitis). Taking biotin does not seem to help improve rash in infants. Is it safe?: When taken by mouth : Biotin is likely safe for most people when taken in doses up to 300 mg daily for up to 6 months. But it is more commonly used in lower doses of 2.5 mg daily. When applied to the skin : Biotin is likely safe for most people when applied in cosmetic products that contain up to 0.6% biotin. Special precautions & warnings: Pregnancy and breast-feeding : Biotin is likely safe when used in recommended amounts during pregnancy and breast-feeding. Children : Biotin is likely safe when taken by mouth. It's been used safely in doses of 5-25 mcg daily. An inherited condition in which the body cannot process biotin (biotinidase deficiency) : People with this condition might have low levels of biotin and may need a biotin supplement. Kidney dialysis : People receiving kidney dialysis might have low levels of biotin and may need a biotin supplement. Smoking : People who smoke might have low biotin levels and may need a biotin supplement. Laboratory tests : Taking biotin supplements might interfere with the results of many different blood lab tests. Biotin can cause falsely high or falsely low test results. This might lead to missed or incorrect diagnoses. Tell your doctor if you are taking biotin supplements, especially if you are having lab tests done. You may need to stop taking biotin before your blood test. Most multivitamins contain low doses of biotin, which are unlikely to interfere with blood tests. But talk to your doctor to be sure. Are there interactions with medications?: It is not known if this product interacts with any medicines.Before taking this product, talk with your health professional if you take any medications. Are there interactions with herbs and supplements?: Alpha-lipoic acid: Taking alpha-lipoic acid and biotin together can reduce the absorption of both alpha-lipoic acid and biotin into the body. Vitamin B5 (pantothenic acid): Taking biotin and vitamin B5 together can reduce the absorption of both biotin and vitamin B5 into the body. Are there interactions with foods?: Eating 2 or more uncooked egg whites daily for several months can cause biotin deficiency. Raw egg whites bind to biotin in the stomach and prevent the body from absorbing it. How is it typically used?: Small amounts of biotin are found in foods such as eggs, milk, and bananas. It's recommended that adults consume 30 mcg daily. The same amount should be consumed during pregnancy. When breast-feeding, 35 mcg should be consumed daily. Recommended amounts for children depend on age. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Vitamin B6",
      "link": "https://medlineplus.gov/druginfo/natural/934.html",
      "source": "MedlinePlus",
      "date": "12/02/2025",
      "content": "What is it?: Vitamin B6 is a type of B vitamin. Pyridoxine, pyridoxal, and pyridoxamine are all forms of vitamin B6. It's found in certain foods and also made in a lab. Vitamin B6 is needed for the proper function of sugars, fats, and proteins in the body. It's also necessary for the development of the brain, nerves, skin, and many other parts of the body. It's found in cereals, legumes, and eggs, and often used with other B vitamins in vitamin B complex products. People commonly use vitamin B6 for preventing and treating vitamin B6 deficiency. It is also used for heart disease, premenstrual syndrome (PMS), depression, morning sickness, Alzheimer disease, menstrual cramps, diabetes, and many other conditions, but there is no good scientific evidence to support many of these other uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for VITAMIN B6 are as follows: There is interest in using vitamin B6 for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Effective for...: A rare seizure disorder that requires vitamin B6. Giving infants vitamin B6 by IV controls seizures caused by a condition called pyridoxine-dependent epilepsy. IV products can only be given by a healthcare provider. A condition in which the body makes abnormal red blood cells that build up iron (sideroblastic anemia). Taking vitamin B6 by mouth is effective for treating an inherited type of anemia called sideroblastic anemia. Vitamin B6 deficiency. Taking vitamin B6 by mouth is effective for preventing and treating vitamin B6 deficiency. Likely effective for...: High levels of homocysteine in the blood (hyperhomocysteinemia). Taking vitamin B6 by mouth, usually with folic acid, is effective for treating high homocysteine levels in the blood. Possibly effective for...: High levels of a hormone called prolactin (hyperprolactinemia) caused by antipsychotic drugs. Taking vitamin B6 by mouth reduces levels of prolactin in males with this condition. Kidney stones. Taking vitamin B6 by mouth, alone or along with magnesium, can decrease the risk of kidney stones, especially in people with an inherited condition that causes kidney stones. Morning sickness. Taking vitamin B6 by mouth improves symptoms of mild to moderate nausea and vomiting during pregnancy. Vitamin B6 plus the drug doxylamine is recommended for those who don't get better when taking vitamin B6 alone. Premenstrual syndrome (PMS). Taking vitamin B6 (pyridoxine) by mouth seems to improve PMS symptoms including breast pain. The lowest effective dose should be used. Higher doses will increase the chance of side effects and aren't likely to increase benefits. Possibly ineffective for...: Decline in memory and thinking skills that occurs normally with age. Taking vitamin B6 by mouth doesn't improve mental function in elderly people. Alzheimer disease. Taking vitamin B6 supplements by mouth or eating large amounts of vitamin B6 in the diet doesn't seem to reduce the risk for Alzheimer disease. Carpal tunnel syndrome. Taking vitamin B6 by mouth doesn't seem to reduce symptoms of carpal tunnel syndrome. Cataracts. Taking vitamin B6 by mouth, together with folic acid and vitamin B12, doesn't prevent cataracts. It might even increase the risk of needing to have cataracts removed. An adverse skin reaction caused by cancer drug treatment (chemotherapy-induced acral erythema). Taking vitamin B6 by mouth doesn't seem to prevent this skin reaction in people treated with cancer drugs. Vitamin B6 might also reduce how well certain cancer drugs work. Non-cancerous growths in the large intestine and rectum (colorectal adenoma). Taking a combination of folic acid, vitamin B6, and vitamin B12 by mouth doesn't reduce the risk of developing colorectal polyps. Seizures in people with high blood pressure during pregnancy (eclampsia). Taking vitamin B6 by mouth or as a shot doesn't seem to reduce the risk of seizures during pregnancy. Vitamin B6 shots can only be given by a healthcare provider. Weak and brittle bones (osteoporosis). Taking a combination of folic acid, vitamin B6, and vitamin B12 by mouth doesn't prevent broken bones in people with osteoporosis. A pregnancy complication marked by high blood pressure and protein in the urine (pre-eclampsia). Taking vitamin B6 by mouth or as a shot doesn't seem to reduce the risk of pre-eclampsia. Vitamin B6 shots can only be given by a healthcare provider. Preterm birth. Taking vitamin B6 by mouth or as a shot doesn't seem to reduce the risk of preterm birth. Vitamin B6 shots can only be given by a healthcare provider. Is it safe?: When taken by mouth : Vitamin B6 is likely safe when used appropriately. Taking vitamin B6 in doses of 100 mg daily or less is generally considered to be safe. Vitamin B6 is possibly safe when taken in doses of 101-200 mg daily. In some people, vitamin B6 might cause nausea, stomach pain, loss of appetite, headache, and other side effects. Vitamin B6 is possibly unsafe when taken in doses of 500 mg or more daily. High doses of vitamin B6, especially 1000 mg or more daily, might cause brain and nerve problems. Special precautions & warnings: Pregnancy : Vitamin B6 is likely safe when taken by mouth, appropriately. It's sometimes used to control morning sickness, but should only be done so under the supervision of a healthcare provider. Taking high doses is possibly unsafe. High doses might cause newborns to have seizures. Breast-feeding : Vitamin B6 is likely safe when taken appropriately. The recommended amount during breast-feeding is 2 mg by mouth daily. Avoid using high amounts. There isn't enough reliable information to know if taking high doses of vitamin B6 is safe when breast-feeding. Post-surgical stent placement . Avoid using a combination of vitamin B6, folate, and vitamin B12 after receiving a coronary stent. This combination may increase the risk of blood vessel narrowing. Weight loss surgery . Taking a vitamin B6 supplement is not needed for people that have had weight loss surgery. Taking too much might increase the chance of side effects such as nausea, vomiting, and browning skin. Are there interactions with medications?: Major: Do not take this combination. Phenytoin (Dilantin): Vitamin B6 might increase how quickly the body breaks down phenytoin. Taking vitamin B6 along with phenytoin might decrease the effects of phenytoin and increase the risk of seizures. Do not take large doses of vitamin B6 if you are taking phenytoin. Moderate: Be cautious with this combination. Amiodarone (Cordarone): Amiodarone might increase sensitivity to sunlight. Taking vitamin B6 along with amiodarone might increase the chances of sunburn, blistering, or rashes on areas of skin exposed to sunlight. Be sure to wear sunblock and protective clothing when spending time in the sun. Medications for high blood pressure (antihypertensive drugs): Vitamin B6 might lower blood pressure. Taking high doses of vitamin B6 along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Phenobarbital (Luminal): Vitamin B6 might increase how quickly the body breaks down phenobarbital. This could decrease the effects of phenobarbital. Minor: Be watchful with this combination. Levodopa: Vitamin B6 can increase how quickly the body breaks down and gets rid of levodopa. But this is only a problem if you are taking levodopa alone. Most people take levodopa along with carbidopa. Carbidopa prevents this interaction from occurring. If you are taking levodopa without carbidopa, do not take vitamin B6. Are there interactions with herbs and supplements?: Herbs and supplements that might lower blood pressure: Vitamin B6 might lower blood pressure. Taking it with other supplements that have the same effect might cause blood pressure to drop too much. Examples of supplements with this effect include andrographis, casein peptides, L-arginine, niacin, and stinging nettle. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Vitamin B6 is an important nutrient. Cereal grains, legumes, vegetables, meat, and eggs are good sources of vitamin B6. The amount that should be consumed on a daily basis is called the recommended dietary allowance (RDA). For males, the RDA is 1.3 mg daily for those 19-50 years old, and 1.7 mg daily for those over 50 years. For females, the RDA is 1.3 mg daily for those 19-50 years old, and 1.5 mg daily for those over 50 years. While pregnant, the RDA is 1.9 mg daily. While breast-feeding, the RDA is 2 mg daily. In children, the RDA depends on age. In supplements, vitamin B6 is often used alone and in products containing other B vitamins. Speak with a healthcare provider to find out what type of product and dose might be best for a specific condition."
    },
    {
      "title": "Folic Acid",
      "link": "https://medlineplus.gov/druginfo/natural/1017.html",
      "source": "MedlinePlus",
      "date": "04/02/2025",
      "content": "What is it?: Folate and folic acid are forms of vitamin B9 used for deficiency and to prevent pregnancy complications. Many foods contain folate or have folic acid added. Since 1998, folic acid has been added to cold cereals, flour, breads, pasta, bakery items, cookies, and crackers, as required by federal law. Foods that are naturally high in folate include leafy vegetables, okra, asparagus, certain fruits, beans, yeast, mushrooms, animal liver and kidney, orange juice, and tomato juice. Folic acid is also available as a supplement, and is often used in combination with other B vitamins. Folic acid is used for preventing and treating low blood levels of folate (folate deficiency) and high blood levels of homocysteine (hyperhomocysteinemia). Folic acid is also taken during pregnancy to prevent serious birth defects such as spina bifida. Folic acid is also used for many other conditions including depression, stroke, decline in memory and thinking skills, and many others. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for FOLIC ACID are as follows: There is interest in using folic acid for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful for these uses. Effective for...: Folate deficiency. Taking folic acid improves folate deficiency. Likely effective for...: High levels of homocysteine in the blood (hyperhomocysteinemia). This condition has been linked to heart disease and stroke. Taking folic acid by mouth lowers homocysteine levels in people with normal or high homocysteine levels and in people with kidney failure. Toxicity caused by the drug methotrexate. Taking folic acid by mouth seems to reduce nausea and vomiting from methotrexate treatment. Birth defects of the brain and spine (neural tube birth defects). Consuming folic acid 600-800 mcg by mouth daily during pregnancy reduces the risk of these birth defects. Folic acid can come from the diet or supplements. Some people who are at high risk should get 4000-5000 mcg daily. Possibly effective for...: Decline in memory and thinking skills in older people. Taking folic acid by mouth, with or without other supplements, may improve memory and thinking skills in older people who have a larger decline in thinking skills than expected at that age. But it doesn't seem to work in older people who are experiencing the usual decline in thinking skills for their age. Depression. Taking folic acid by mouth along with antidepressants seems to improve symptoms in some people with depression. High blood pressure. Taking folic acid by mouth daily for at least 6 weeks reduces blood pressure in some people with high blood pressure who are not taking other blood pressure medications. Gum enlargement caused by the drug phenytoin. Applying folic acid to the gums seems to prevent this issue. But taking folic acid by mouth doesn't seem to help. Stroke. In areas of the world that don't add folic acid to grain products, taking folic acid supplements can reduce the risk of stroke. But supplements don't seem to be helpful for people who live in countries that do add folic acid to grain products. A skin disorder that causes white patches to develop on the skin (vitiligo). Taking folic acid by mouth seems to improve symptoms of this condition. Possibly ineffective for...: Low levels of healthy red blood cells (anemia) due to iron deficiency. Adding folic acid to an iron supplement does not help to treat anemia any better than taking an iron supplement alone. Decline in memory and thinking skills that occurs normally with age. Taking folic acid by mouth doesn't seem to prevent a decline in mental function that occurs normally in healthy aging adults. Cataracts. Taking folic acid by mouth with vitamin B6 and vitamin B12 does not prevent cataracts. In fact, it might increase the number of cataracts that need to be removed. Diarrhea. Taking folic acid by mouth doesn't seem to prevent diarrhea in children who are at risk of malnutrition. In fact, it may even increase the risk of having diarrhea that lasts more than a few days. Fall prevention. Taking folic acid by mouth with vitamin B12 does not seem to prevent falls in older people who are also taking vitamin D. Male infertility. Taking folic acid by mouth, alone or with other ingredients, does not seem to improve male fertility. Death of an unborn or premature baby. Taking folic acid by mouth during pregnancy does not seem to reduce the risk of a baby dying just before or after birth. But it does help prevent other health issues in the baby. Cancer of the white blood cells (leukemia). Taking folate by mouth during pregnancy does not reduce the risk of this type of cancer in children. Weak and brittle bones (osteoporosis). In elderly individuals with osteoporosis, taking folic acid by mouth with vitamin B12 and/or vitamin B6 does not seem to prevent broken bones. Physical performance in elderly adults. Taking folic acid by mouth with vitamin B12 doesn't seem to help older people walk better or have stronger hands. High blood pressure during pregnancy. High-dose folic acid supplements do not seem to reduce blood pressure during pregnancy, or the risk of developing a condition called pre-eclampsia. Infection of the airways. Taking folic acid by mouth doesn't seem to prevent infections in the lungs in children at risk of malnutrition. Likely ineffective for...: Non-cancerous growths in the large intestine and rectum (colorectal adenoma). Taking folic acid supplements does not prevent growths in the large intestine or rectum. An inherited condition marked by learning disabilities (fragile-X syndrome). Taking folic acid by mouth does not improve symptoms of fragile X syndrome. Preterm birth. Taking folic acid by mouth during pregnancy does not decrease the risk of having a premature baby. But it does help to prevent other health issues in the baby. Is it safe?: When taken by mouth : It is likely safe for most people to take folic acid in doses of no more than 1 mg daily. Doses higher than 1 mg daily may be unsafe. These doses might cause stomach upset, nausea, diarrhea, irritability, confusion, behavior changes, skin reactions, seizures, and other side effects. Another form of folic acid, L-5-methyltetrahydrofolate (L-5-MTHF), can also be found in supplements. This type of folic acid is possibly safe for most people in doses up to about 400 mcg daily. There is some concern that taking too much folic acid for a long time might cause serious side effects. Some research suggests that taking folic acid in doses of 0.8-1.2 mg daily might increase the risk for cancer or increase the risk of heart attack in people who have heart problems. Special precautions & warnings: Pregnancy and breast-feeding : Folic acid 300-400 mcg daily is recommended during pregnancy to prevent certain birth defects. The maximum recommended amount of folic acid during pregnancy or breastfeeding is 800 mcg daily for those under 18 years of age and 1000 mcg daily for those over 18 years of age. Do not use more unless directed by a healthcare professional. Another form of folic acid, L-5-methyltetrahydrofolate (L-5-MTHF), can also be found in supplements. This type of folic acid is possibly safe to take at a dose of up to 400 mcg daily when pregnant or breastfeeding. Children : It is likely safe for children to take folic acid by mouth in the recommended amounts for their age. But children should avoid taking folic acid in doses that are higher than the daily upper limits. These limits are 300 mcg for 1-3 years of age, 400 mcg for 4-8 years of age, 600 mcg for 9-13 years of age, and 800 mcg for 14-18 years of age. Another form of folic acid, L-5-methyltetrahydrofolate (L-5-MTHF), can also be found in supplements. This type of folic acid is possibly safe in children. Procedures to widen narrowed arteries (angioplasty) : Using folic acid, vitamin B6, and vitamin B12 might worsen narrowed arteries. Folic acid should not be used by people recovering from this procedure. Cancer : Early research suggests that taking 0.8-1 mg of folic acid daily might increase the risk of cancer. Until more is known, people with a history of cancer should avoid high doses of folic acid. Seizure disorder : Taking folic acid supplements, especially in high doses, might make seizures worse in people with seizure disorders. Vitamin B12 deficiency : Taking folic acid supplements might improve certain lab tests in people with low vitamin B12 levels. This may make it seem like vitamin B12 deficiency is improved when it isn't. If left untreated, this could cause permanent nerve damage. Are there interactions with medications?: Moderate: Be cautious with this combination. 5-Fluorouracil: There is some concern that taking large amounts of folic acid with 5-fluorouracil might increase some side effects of 5-fluorouracil, especially stomach problems. Talk with your healthcare provider before taking folic acid. Capecitabine (Xeloda): There is some concern that taking large amounts of folic acid might increase the side effects of capecitabine, especially stomach problems like diarrhea and vomiting. Talk with your healthcare provider before taking folic acid. Fosphenytoin (Cerebyx): Fosphenytoin is used for seizures. The body breaks down fosphenytoin to get rid of it. Folic acid can increase how quickly the body breaks down fosphenytoin. Taking folic acid along with fosphenytoin might decrease the effects of fosphenytoin for preventing seizures. Phenobarbital (Luminal): Phenobarbital is used for seizures. Taking folic acid can decrease how well phenobarbital works for preventing seizures. Phenytoin (Dilantin): The body breaks down phenytoin to get rid of it. Folic acid might increase how quickly the body breaks down phenytoin. Taking folic acid and taking phenytoin might decrease the effectiveness of phenytoin and increase the possibility of seizures. Primidone (Mysoline): Primidone is used for seizures. Folic acid might cause seizures in some people. Taking folic acid along with primidone might decrease how well primidone works for preventing seizures. Pyrimethamine (Daraprim): Pyrimethamine is used to treat parasite infections. Folic acid might decrease the effects of pyrimethamine for treating parasite infections. Are there interactions with herbs and supplements?: Green tea: There is some concern that green tea extract might keep folic acid from working the way it should in the body. This might lead to a condition that is similar to folic acid deficiency. Zinc: Folic acid might interfere with zinc absorption. But people who get enough zinc in their diet do not need to worry about this effect. Are there interactions with foods?: Folic acid can be taken with food or without food.But drinking green tea might lower folic acid levels in the body. If you have low folic acid levels, avoid drinking green tea. How is it typically used?: Folic acid is an important nutrient. The amount that should be consumed on a daily basis is called the recommended dietary allowance (RDA). The RDA for folic acid is provided as Dietary Folate Equivalents, or DFE. This is because the body absorbs the folic acid in supplements better than the folate found in food. 1 mcg DFE is the same as 1 mcg of folate found in food. But 1 mcg DFE is the same as 0.6 mcg of folic acid supplements. The RDA in adults is 400 mcg DFE daily. In pregnancy, the RDA is 600 mcg DFE daily. When breastfeeding, the RDA is 500 mcg DFE daily. In children, the RDA depends on age. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Boron",
      "link": "https://medlineplus.gov/druginfo/natural/894.html",
      "source": "MedlinePlus",
      "date": "11/04/2024",
      "content": "What is it?: Boron is an element. Boron has been consumed for menstrual cramps and boric acid has been used vaginally for yeast infections, but evidence is limited. Boron seems to affect the way the body handles other minerals such as calcium, magnesium, and phosphorus. It also seems to increase estrogen levels post-menopause. Boric acid, a common form of boron, can kill yeast that cause vaginal infections. Boron may have antioxidant effects. People commonly use boron for boron deficiency and vaginal yeast infections. It is also used for athletic performance, menstrual cramps, osteoarthritis, osteoporosis, and many other conditions, but there is no good scientific evidence to support many of these uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for BORON are as follows: There is interest in using boron for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Likely effective for...: Boron deficiency. Taking boron by mouth treats and prevents boron deficiency. Possibly effective for...: Skin damage caused by radiation therapy (radiation dermatitis). Applying boron gel to the skin might help prevent skin damage caused by radiation therapy. Vaginal yeast infections. Applying boric acid inside the vagina can help treat yeast infections (candidiasis), including infections that do not seem to get better with other medications and treatments. Possibly ineffective for...: Athletic performance. Taking boron by mouth doesn't seem to improve body mass, muscle mass, or testosterone levels in male bodybuilders. Is it safe?: When taken by mouth : Boron is likely safe when used in doses that don't exceed 20 mg daily. Boron is possibly unsafe when taken in higher doses. Doses over 20 mg daily might cause male fertility problems. Large doses can also cause poisoning. Signs of poisoning include irritability, tremors, weakness, headaches, diarrhea, vomiting, and other symptoms. When applied to the skin : Sodium pentaborate pentahydrate gel, which contains boron, is likely safe when applied to the skin for up to 5 weeks. When applied into the vagina : Boric acid, a common form of boron, is likely safe when used for up to 6 months. It can cause vaginal burning. Special precautions & warnings: Pregnancy and breast-feeding : Boron is likely safe when taken by mouth during pregnancy or breast-feeding. For those 19-50 years old, do not take more than 20 mg daily; for those 14-18 years old, do not take more than 17 mg daily. Taking boron by mouth in higher doses is possibly unsafe and has been linked to lower birth weights and birth defects. Applying boric acid into the vagina during the first 4 months of pregnancy has also been linked to birth defects. Children : Boron is likely safe when used appropriately. The amount that is safe depends on the child's age. Boron is possibly unsafe when taken by mouth in higher doses. Large quantities of boron can cause poisoning. Boric acid powder, a common form of boron, is possibly unsafe when applied in large amounts to prevent diaper rash. Hormone-sensitive condition such as breast cancer, uterine cancer, ovarian cancer, endometriosis, or uterine fibroids : Boron might act like estrogen. If you have any condition that might be made worse by estrogen, avoid supplemental boron or high amounts of boron from foods. Kidney disease : Do not take boron supplements if you have kidney problems. The kidneys have to work hard to flush out boron. Are there interactions with medications?: It is not known if this product interacts with any medicines.Before taking this product, talk with your health professional if you take any medications. Are there interactions with herbs and supplements?: Magnesium: Boron supplements can increase how much magnesium stays in the body. This can increase blood levels of magnesium. But it's not clear if this is a big concern. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Boron is naturally found in water and foods such as nuts and vegetables. There aren't any specific dietary recommendations for boron, but it's estimated that most adults consume about 1-1.5 mg daily. In supplements, adults shouldn't consume more than 20 mg daily. For children, the amount that is safe depends on age. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Coconut Oil",
      "link": "https://medlineplus.gov/druginfo/natural/1092.html",
      "source": "MedlinePlus",
      "date": "29/03/2023",
      "content": "What is it?: Coconut oil comes from the nut (fruit) of the coconut palm. It contains medium-chain fatty acids, including capric acid, caprylic acid, and lauric acid. About 52% to 85% of coconut oil is made up of specific saturated fats, called medium-chain fatty acids. It has a moisturizing effect when applied to the skin. People commonly use coconut oil for eczema and growth in premature infants. It's also used for psoriasis, obesity, breast cancer, heart disease, MS, and many other conditions, but there is no good scientific evidence to support these uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for COCONUT OIL are as follows: There is interest in using coconut oil for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Eczema (atopic dermatitis). Applying coconut oil to the skin can reduce eczema symptoms in children more than applying mineral oil. Growth and development in premature infants. Applying coconut oil to the skin of premature infants might improve body temperature, breathing, skin health, and overall growth. Is it safe?: When taken by mouth : Coconut oil is commonly consumed in foods. But coconut oil contains a type of fat (saturated fat) that can increase cholesterol levels. Like all saturated fats, it should be consumed in moderation. Coconut oil is possibly safe when used as a medicine short-term. Taking coconut oil in doses of 10 mL two or three times daily for up to 12 weeks seems to be safe. When applied to the skin : Coconut oil is likely safe when applied to the skin. Special precautions & warnings: Pregnancy and breast-feeding : Coconut oil is commonly consumed in foods. There isn't enough reliable information to know if coconut oil is safe to use as medicine when pregnant or breast-feeding. Stay on the safe side and stick to food amounts. Children : Coconut oil is possibly safe when applied to the skin for about one month. There isn't enough reliable information to know if coconut oil is safe for children when taken by mouth as a medicine. High cholesterol : Coconut oil contains a type of fat that can increase cholesterol levels. Regularly eating meals containing coconut oil can increase levels of low-density lipoprotein (LDL or \"bad\") cholesterol. This might be a problem for people who already have high cholesterol. Are there interactions with medications?: It is not known if this product interacts with any medicines.Before taking this product, talk with your health professional if you take any medications. Are there interactions with herbs and supplements?: Blond psyllium: Psyllium might reduce the amount of fat that the body absorbs from coconut oil. Chlorogenic acid: Coconut oil might increase the amount of chlorogenic acid that the body absorbs from supplements. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Coconut oil has most often been used by adults in doses of 20-60 mL by mouth daily for up to 4 months. Coconut oil is also used as a topical oil or moisturizer and is found in some cosmetics. Speak with a healthcare provider to find out what type of product and dose might be best for a specific condition. Some coconut oil products are referred to as \"virgin\" coconut oil, which usually means they haven't been bleached, deodorized, or refined. But there aren't any specific industry standards. \"Cold pressed\" coconut oil means that it's been pressed without a heat source."
    },
    {
      "title": "Cod Liver Oil",
      "link": "https://medlineplus.gov/druginfo/natural/1040.html",
      "source": "MedlinePlus",
      "date": "15/06/2023",
      "content": "What is it?: Cod liver oil can be obtained from eating fresh cod liver or by taking supplements. It is a source of vitamins A and D and a fat called omega-3. Cod liver oil contains certain \"fatty acids\" that prevent the blood from clotting easily. These fatty acids also reduce pain and swelling. Cod liver oil is used for heart health, depression, arthritis, and many other conditions, but there is no good scientific evidence to support these uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for COD LIVER OIL are as follows: There is interest in using cod liver oil for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly ineffective for...: Coronavirus disease 2019 (COVID-19). Taking cod liver oil by mouth does not seem to help prevent COVID-19. Is it safe?: When taken by mouth : Cod liver oil is likely safe for most adults. It can cause side effects including heartburn, stomach upset, and nausea. High doses of cod liver oil are possibly unsafe. They might keep blood from clotting and can increase the chance of bleeding. Vitamin A and vitamin D levels might also become too high with high doses of cod liver oil. When applied to the skin : There isn't enough reliable information to know if cod liver oil is safe or what the side effects might be. Special precautions & warnings: Pregnancy and breast-feeding : Cod liver oil is possibly safe when used in amounts that provide no more than the recommended daily intakes of vitamin A and vitamin D. Cod liver oil is possibly unsafe when taken in larger amounts. Do not take cod liver oil that provides more than about 3000 mcg of vitamin A and 100 mcg of vitamin D when pregnant or breast-feeding. Children : Cod liver oil is likely safe for most children when taken by mouth in amounts that provide no more than the recommended daily intakes of vitamin A and vitamin D. Cod liver oil is possibly unsafe when taken in larger amounts. Diabetes : Cod liver oil or other fish oils might increase blood sugar in people with diabetes, but it's not clear if this is a major concern. Cod liver oil might also lower blood sugar levels and increase the effects of some antidiabetes drugs. If you have diabetes and use cod liver oil, monitor your blood sugar levels closely. Are there interactions with medications?: Moderate: Be cautious with this combination. Medications for diabetes (Antidiabetes drugs): Cod liver oil might lower blood sugar levels. Taking cod liver oil along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Medications for high blood pressure (Antihypertensive drugs): Cod liver oil might lower blood pressure. Taking cod liver oil along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): Cod liver oil might slow blood clotting. Taking cod liver oil along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Are there interactions with herbs and supplements?: Herbs and supplements that might lower blood pressure: Cod liver oil might lower blood pressure. Taking it with other supplements that have the same effect might cause blood pressure to drop too much. Examples of supplements with this effect include andrographis, casein peptides, L-arginine, niacin, and stinging nettle. Herbs and supplements that might lower blood sugar: Cod liver oil might lower blood sugar. Taking it with other supplements with similar effects might lower blood sugar too much. Examples of supplements with this effect include aloe, bitter melon, cassia cinnamon, chromium, and prickly pear cactus. Herbs and supplements that might slow blood clotting: Cod liver oil might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Cod liver oil has most often been used by adults in doses of 15-20 mL by mouth daily for up to 4 months. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Whey Protein",
      "link": "https://medlineplus.gov/druginfo/natural/833.html",
      "source": "MedlinePlus",
      "date": "26/08/2021",
      "content": "What is it?: Whey protein is the protein from whey, the watery portion of milk that separates from the curds when making cheese. It is commonly used as a protein supplement. Whey protein might improve the nutrient content of the diet and also have effects on the immune system. People commonly use whey protein for improving athletic performance and increasing strength. Whey protein is also used for asthma, diabetes, weight loss, and many other conditions, but there is no good scientific evidence to support most of these uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for WHEY PROTEIN are as follows: There is interest in using whey protein for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Athletic performance. Regularly consuming whey protein by mouth while also regularly exercising increases muscle strength and athletic performance. But it seems that both must be done consistently to see benefits. Possibly ineffective for...: A lung disease that makes it harder to breathe (chronic obstructive pulmonary disease or COPD). Taking whey protein by mouth doesn't seem to help COPD symptoms. Weak and brittle bones (osteoporosis). Taking whey protein by mouth for up to 2 years doesn't improve bone density in older adults. Is it safe?: When taken by mouth : Whey protein is likely safe for most adults when taken appropriately. High doses can cause some side effects such as increased bowel movements, acne, nausea, thirst, bloating, reduced appetite, tiredness, and headache. Special precautions & warnings: Pregnancy and breast-feeding : There isn't enough reliable information to know if whey protein is safe to use when pregnant or breast-feeding. Stay on the safe side and avoid use. Children : Whey protein is likely safe for children when used in amounts commonly found in food or when included in infant formulas. Milk allergy : If you are allergic to cow's milk, avoid using whey protein. Are there interactions with medications?: Major: Do not take this combination. Levodopa: Whey protein might decrease how much levodopa the body absorbs. This might decrease the effects of levodopa. Do not take whey protein and levodopa at the same time. Moderate: Be cautious with this combination. Antibiotics (Quinolone antibiotics): Whey protein might decrease how well some antibiotics work. To avoid this interaction, take antibiotics at least 2 hours before or 4-6 hours after whey protein. Antibiotics (Tetracycline antibiotics): Whey protein might decrease how well some antibiotics work. To avoid this interaction, take antibiotics at least 2 hours before or 4-6 hours after whey protein. Bisphosphonates: Whey protein can decrease the effects of bisphosphates. To avoid this interaction, take bisphosphonates at least 30 minutes before whey or, preferably, at a different time of day. Are there interactions with herbs and supplements?: There are no known interactions with herbs and supplements. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Whey protein has most often been used by adults in doses of up to 30 grams by mouth daily for up to 6 months. Speak with a healthcare provider to find out what dose might be best for a specific purpose."
    },
    {
      "title": "Collagen Peptides",
      "link": "https://medlineplus.gov/druginfo/natural/1606.html",
      "source": "MedlinePlus",
      "date": "17/04/2024",
      "content": "What is it?: Collagen peptides are very small pieces of protein from animal collagen. Collagen is one of the materials that makes up cartilage, bone, and skin. Collagen peptides are made by breaking down whole collagen proteins into smaller pieces. When taken by mouth, collagen peptides seem to build up in the skin and cartilage. This might help improve some skin and joint conditions. Collagen peptides are used for dry skin, aging skin and osteoarthritis. They are also used for osteoporosis, brittle nails, muscle strength, and many other purposes, but there is no good scientific evidence to support most of these uses. Don't confuse collagen peptides with collagen type I (native), collagen type II (native), or gelatin. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for COLLAGEN PEPTIDES are as follows: There is interest in using collagen peptides for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Aging skin. Taking collagen peptides by mouth seems to improve skin hydration and skin elasticity in older people. It might also help reduce wrinkles, but it's not clear if it helps enough to be noticeable. Dry skin. Taking collagen peptides by mouth seems to improve skin hydration and skin elasticity in people with dry skin. Possibly ineffective for...: Muscle strength. Taking collagen peptides by mouth does not seem to improve leg muscle strength. However, collagen peptides may improve hand-grip strength. Is it safe?: When taken by mouth : Collagen peptides are possibly safe. Collagen peptides have been safely used in doses up to 10 grams daily for up to 6 months. Side effects are rare. Special precautions & warnings: Pregnancy and breast-feeding : There isn't enough reliable information to know if collagen peptides are safe to use when pregnant or breast-feeding. Stay on the safe side and avoid use. Are there interactions with medications?: It is not known if this product interacts with any medicines.Before taking this product, talk with your health professional if you take any medications. Are there interactions with herbs and supplements?: There are no known interactions with herbs and supplements. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Collagen peptides have most often been used by adults in doses of 2.5-10 grams daily for up to 6 months. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "L-Arginine",
      "link": "https://medlineplus.gov/druginfo/natural/875.html",
      "source": "MedlinePlus",
      "date": "04/02/2025",
      "content": "What is it?: L-arginine is an amino acid naturally found in red meat, poultry, fish, and dairy. It is necessary for making proteins and is commonly used for circulation. L-arginine is converted in the body into a chemical called nitric oxide. Nitric oxide causes blood vessels to open wider for improved blood flow. L-arginine also stimulates the release of growth hormone, insulin, and other substances in the body. It can be made in a lab and used in supplements. People use L-arginine for chest pain and various blood flow issues, erectile dysfunction, high blood pressure during pregnancy, and a serious disease in premature infants called necrotizing enterocolitis (NEC). It's also used for many other conditions, but there is no good scientific evidence to support these other uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for L-ARGININE are as follows: There is interest in using L-arginine for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Chest pain (angina). Taking L-arginine by mouth seems to decrease symptoms and improve exercise tolerance and quality of life in people with angina. But it doesn't seem to help widen blood vessels that are narrowed in angina. Erectile dysfunction (ED). Taking 2.5-5 grams of L-arginine by mouth daily seems to improve sexual function in people with ED. Taking L-arginine with medications such as sildenafil and tadalafil might work better than taking either L-arginine or the medication alone. High blood pressure. Taking L-arginine by mouth can reduce blood pressure in healthy people, people with high blood pressure, and people with slightly high blood pressure with or without diabetes. A serious intestinal disease in premature infants (necrotizing enterocolitis or NEC). Adding L-arginine to formula seems to reduce the risk for this condition in premature infants. Narrowing of blood vessels that causes poor blood flow to the limbs (peripheral arterial disease). Taking L-arginine by mouth or by IV for up to 8 weeks increases blood flow in people with this condition. But using it for up to 6 months does not help to improve walking speed or distance. IV products can only be given by a healthcare provider. A pregnancy complication marked by high blood pressure and protein in the urine (pre-eclampsia). Taking L-arginine by IV can reduce blood pressure in patients with pre-eclampsia. L-arginine might also reduce the risk of pre-eclampsia in people who are at high risk for this condition. IV products can only be given by a healthcare provider. It's not clear if taking L-arginine by mouth helps. High blood pressure during pregnancy. Taking L-arginine by IV can reduce blood pressure in pregnancy. It's unclear if taking L-arginine by mouth lowers blood pressure during pregnancy, but it might decrease the need to take blood pressure lowering drugs. IV products can only be given by a healthcare provider. Possibly ineffective for...: Long-term kidney disease (chronic kidney disease or CKD). Taking L-arginine by mouth or by IV doesn't improve kidney function in most people with CKD. High cholesterol. Taking L-arginine by mouth doesn't help to lower cholesterol levels. Heart attack. Taking L-arginine by mouth doesn't seem to help prevent a heart attack. It also doesn't seem to help treat a heart attack after it occurs. In fact, there is concern that L-arginine might be harmful for people after a recent heart attack. Do not take L-arginine if you have had a recent heart attack. Tuberculosis. Taking L-arginine by mouth along with standard treatment for tuberculosis does not seem to help improve symptoms or clear the infection. Wound healing. Taking L-arginine by mouth does not seem to improve wound healing. Is it safe?: When taken by mouth : L-arginine is possibly safe for most people when taken short-term. It can cause some side effects such as stomach pain, bloating, diarrhea, and low blood pressure. When applied to the skin : L-arginine is possibly safe for most people when used short-term. It's also possibly safe when used in a toothpaste short-term. When inhaled : L-arginine is possibly safe for most people when used short-term. Special precautions & warnings: Pregnancy : L-arginine is possibly safe when taken by mouth for a short time during pregnancy. Not enough is known about using L-arginine long-term in pregnancy. Stay on the safe side and avoid long-term use. Breast-feeding : There isn't enough reliable information to know if L-arginine is safe to use when breast-feeing. Stay on the safe side and avoid use. Children : L-arginine is possibly safe in children when taken by mouth, when used in a toothpaste, or when inhaled. Guanidinoacetate methyltransferase deficiency (GAMT) : People with this inherited condition are unable to convert arginine and other similar chemicals into creatine. To prevent complications from this condition, avoid L-arginine supplements. Recent heart attack : L-arginine might increase the risk of death after a heart attack, especially in older people. If you have had a heart attack recently, don't take L-arginine. Kidney disease : L-arginine has caused high potassium levels when used by people with kidney disease. In some cases, this has resulted in a dangerous irregular heartbeat. Surgery : L-arginine might interfere with blood pressure control during and after surgery. Stop taking L-arginine at least 2 weeks before a scheduled surgery. Are there interactions with medications?: Moderate: Be cautious with this combination. Isoproterenol (Isuprel): L-arginine seems to decrease blood pressure. Isoproterenol is a drug that is used to lower blood pressure. Taking L-arginine along with isoproterenol might cause your blood pressure to go too low. Medications for diabetes (Antidiabetes drugs): L-arginine might lower blood sugar levels. Taking L-arginine along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Medications for high blood pressure (ACE inhibitors): L-arginine might lower blood pressure. Taking L-arginine along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications for high blood pressure (Angiotensin receptor blockers (ARBs)): L-arginine might lower blood pressure. Taking L-arginine along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications for high blood pressure (Antihypertensive drugs): L-arginine might lower blood pressure. Taking L-arginine along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): L-arginine might slow blood clotting. Taking L-arginine along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Sildenafil (Viagra): Sildenafil can lower blood pressure. L-arginine can also lower blood pressure. There is a chance that taking sildenafil and L-arginine together might cause blood pressure to go too low. But most people seem to be fine when taking these products together. Water pills (Potassium-sparing diuretics): L-arginine might increase potassium levels in the body. Some \"water pills\" might also increase potassium in the body. Taking L-arginine along with some \"water pills\" might cause too much potassium to be in the body. Minor: Be watchful with this combination. Testosterone: L-arginine might increase testosterone levels. But it's not clear if this is a big concern. People taking testosterone should be cautious until more is known about this potential interaction. Are there interactions with herbs and supplements?: Herbs and supplements that might lower blood pressure: L-arginine might lower blood pressure. Taking it with other supplements that have the same effect might cause blood pressure to drop too much. Examples of supplements with this effect include andrographis, casein peptides, niacin, and stinging nettle. Herbs and supplements that might lower blood sugar: L-arginine might lower blood sugar. Taking it with other supplements with similar effects might lower blood sugar too much. Examples of supplements with this effect include aloe, bitter melon, cassia cinnamon, chromium, and prickly pear cactus. Herbs and supplements that might slow blood clotting: L-arginine might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: L-arginine has most often been used by adults in doses that vary from 1.5 to 24 grams by mouth daily, for up to 18 months. It's also sometimes used in gels and creams. Speak with a healthcare provider to find out what type of product or dose might be best for a specific condition."
    },
    {
      "title": "L-Tryptophan",
      "link": "https://medlineplus.gov/druginfo/natural/326.html",
      "source": "MedlinePlus",
      "date": "12/05/2023",
      "content": "What is it?: L-Tryptophan is an essential amino acid that is necessary for making proteins. It is naturally found in red meat, poultry, eggs, and dairy. L-tryptophan is important for many organs in the body. L-tryptophan is not made by the body and must be consumed from the diet. After absorbing L-tryptophan from food, the body converts some of it to 5-HTP and then to serotonin. Serotonin is a hormone that transmits signals between nerve cells. Changes in serotonin levels in the brain can affect mood. People use L-tryptophan for severe PMS symptoms, depression, insomnia, and many other conditions, but there is no good scientific evidence to support any of these uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for L-TRYPTOPHAN are as follows: There is interest in using L-tryptophan for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly ineffective for...: Depression. Taking L-tryptophan by mouth doesn't seem to be beneficial in patients with depression. Also, it may increase the risk of side effects of some medications. Is it safe?: When taken by mouth : L-tryptophan occurs naturally in many foods, and is consumed as part of the diet. L-tryptophan supplements are possibly safe when taken for up to 3 weeks. L-tryptophan can cause some side effects such as drowsiness, stomach pain, vomiting, diarrhea, headache, blurry vision, and others. In 1989, L-tryptophan was linked to cases of a neurological condition called eosinophilia-myalgia syndrome (EMS). But these cases might be due to contamination. About 95% of all EMS cases have been traced to L-tryptophan produced by a single manufacturer in Japan. There isn't enough reliable information to know if L-tryptophan is safe when taken for more than 3 weeks. Special precautions & warnings: Pregnancy : It is possibly unsafe to take L-tryptophan in amounts greater than those found in foods during pregnancy. It might harm the unborn child. Breast-feeding : There isn't enough reliable information to know if L-tryptophan is safe to use when breast-feeding. Stay on the safe side and stick to food amounts. Are there interactions with medications?: Major: Do not take this combination. Sedative medications (CNS depressants): L-tryptophan might cause sleepiness and slowed breathing. Some medications, called sedatives, can also cause sleepiness and slowed breathing. Taking L-tryptophan with sedative medications might cause breathing problems and/or too much sleepiness. Moderate: Be cautious with this combination. Serotonergic drugs: L-tryptophan might increase a brain chemical called serotonin. Some medications also have this effect. Taking L-tryptophan along with these medications might increase serotonin too much. This might cause serious side effects including heart problems, seizures, and vomiting. Are there interactions with herbs and supplements?: Herbs and supplements with sedative properties: L-tryptophan might cause sleepiness and slowed breathing. Taking it along with other supplements with similar effects might cause too much sleepiness and/or slowed breathing in some people. Examples of supplements with this effect include hops, kava, melatonin, and valerian. Herbs and supplements with serotonergic properties: L-tryptophan increases a brain chemical called serotonin. Taking it along with other supplements that have this effect might cause serious side effects, including heart problems, seizures, and vomiting. Examples of supplements with this effect include 5-HTP, black seed, SAMe, and St. John's wort. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: L-tryptophan supplements have most often been used by adults in doses of 60 mg by mouth daily for 16 weeks. Speak with a healthcare provider to find out what dose might be best for a specific condition. Keep in mind that some dietary supplement products might not list L-tryptophan separately on the label. Instead, it might be listed under niacin. Niacin is measured in niacin equivalents (NE). 60 mg of L-tryptophan is the same as 1 mg NE."
    },
    {
      "title": "Creatine",
      "link": "https://medlineplus.gov/druginfo/natural/873.html",
      "source": "MedlinePlus",
      "date": "01/02/2024",
      "content": "What is it?: Creatine is a chemical found naturally in the body. It's also in red meat and seafood. It is often used to improve exercise performance and muscle mass. Creatine is involved in making energy for muscles. About 95% of it is found in skeletal muscle. The majority of sports supplements in the US contain creatine. People who have lower creatine levels when they start taking creatine seem to get more benefit than people who start with higher levels. People commonly use creatine for improving exercise performance and increasing muscle mass. It is also used for muscle cramps, fatigue, multiple sclerosis (MS), depression, and many other conditions, but there is no good scientific evidence to support most of these uses. Creatine use is allowed by the International Olympic Committee and National Collegiate Athletic Association (NCAA). How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for CREATINE are as follows: There is interest in using creatine for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Athletic performance. Taking creatine by mouth seems to somewhat improve rowing, jumping, and soccer performance. It's not clear if it helps with sprinting, cycling, swimming, or tennis. Disorders of creatine metabolism or transport. Taking creatine by mouth daily can increase creatine levels in the brain in children and young adults with conditions called GAMT deficiency or AGAT deficiency. But taking creatine doesn't seem to improve brain creatine levels in children who have a disorder in which creatine isn't transported properly. Muscle strength. Taking creatine by mouth seems to somewhat improve muscle strength in both younger and older adults. It's not clear if applying creatine to the skin helps. Age-related muscle loss (sarcopenia). Taking creatine by mouth for up to 12 weeks seems to improve muscle strength in older adults. It seems to work best when used along with exercise to build muscles. Possibly ineffective for...: Lou Gehrig disease (amyotrophic lateral sclerosis or ALS). Taking creatine by mouth does not seem to slow disease progression or improve survival in people with ALS. An inherited brain disorder that affects movements, emotions, and thinking (Huntington disease). Taking creatine by mouth does not improve symptoms in people with Huntington disease. Low bone mass (osteopenia). Taking creatine by mouth doesn't seem to slow or reduce bone loss in people with osteopenia. Is it safe?: When taken by mouth : Creatine is likely safe for most people. Doses up to 25 grams daily for up to 14 days have been safely used. Lower doses up to 4-5 grams daily for up to 18 months have also been safely used. Creatine is possibly safe when taken long-term. Doses up to 10 grams daily for up to 5 years have been safely used. Side effects might include dehydration, upset stomach, and muscle cramps. When applied to the skin : There isn't enough reliable information to know if creatine is safe. It might cause side effects such as redness and itching. Special precautions & warnings: Pregnancy and breast-feeding : There isn't enough reliable information to know if creatine is safe to use when pregnant or breast feeding. Stay on the safe side and avoid use. Children : Creatine is possibly safe when taken by mouth, short-term. Creatine 3-5 grams daily for 2-6 months has been taken safely in children 5-18 years of age. Creatine 2 grams daily for 6 months has been taken safely in children 2-5 years of age. Creatine 0.1-0.4 grams/kg daily for up to 6 months has been taken safely in both infants and children. Bipolar disorder : Creatine might make mania worse in people with bipolar disorder. Kidney disease : Creatine might make kidney disease worse in people who already have kidney disease. If you have kidney disease, speak with a healthcare professional before using creatine. Parkinson disease : Caffeine and creatine taken together may make symptoms of Parkinson disease worse. If you have Parkinson disease and take creatine, use caffeine with caution. Are there interactions with medications?: It is not known if this product interacts with any medicines.Before taking this product, talk with your health professional if you take any medications. Are there interactions with herbs and supplements?: Caffeine: Caffeine might decrease creatine's beneficial effects on athletic performance. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Creatine is found in foods such as meat and seafood. Creatine is also found in many different types of sports supplements. In supplements, creatine has most often been used by adults in a one-time loading dose of up to 20 grams by mouth daily for up to 7 days, followed by a maintenance dose of 2.25-10 grams daily for up to 16 weeks. Speak with a healthcare provider to find out what type of product and dose might be best for a specific condition. Creatine is allowed by the International Olympic Committee and National Collegiate Athletic Association (NCAA)."
    },
    {
      "title": "Lactobacillus acidophilus",
      "link": "https://medlineplus.gov/druginfo/natural/790.html",
      "source": "MedlinePlus",
      "date": "12/04/2024",
      "content": "What is it?: Lactobacillus acidophilus (L. acidophilus) is a type of probiotic (\"good\" bacteria) found in the human gut, mouth, and vagina, and also in certain foods. \"Good\" bacteria such as L. acidophilus can help break down food, absorb nutrients, and fight off \"bad\" organisms that might cause diseases. L. acidophilus is sometimes added to fermented foods like yogurt and is also found in probiotic supplements. People commonly use L. acidophilus for diarrhea from antibiotics, as well as irritable bowel syndrome (IBS), overgrowth of bacteria in the vagina, and an infection caused by the bacteria Helicobacter pylori (H. pylori). It is also used for acne, hay fever, eczema, and many other conditions, but there is no good scientific evidence to support many of these other uses. There is also no good evidence to support using L. acidophilus COVID-19. Don't confuse L. acidophilus with other probiotics, or with fermented food products such as fermented milk, kefir, or yogurt. These are not the same. Also note that the Lactobacillus genus was split up into 25 different genera in April 2020. Some other species' names changed, but L. acidophilus remained the same. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for LACTOBACILLUS ACIDOPHILUS are as follows: There is interest in using L. acidophilus for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Diarrhea in people taking antibiotics (antibiotic-associated diarrhea). Taking L. acidophilus by mouth, alone or with other probiotics, seems to reduce the risk of diarrhea while taking antibiotics. Overgrowth of bacteria in the vagina. L. acidophilus vaginal suppositories and vaginal tablets might help treat this condition. But it's not clear if taking L. acidophilus by mouth helps. A digestive tract infection that can lead to ulcers (Helicobacter pylori or H. pylori). Taking L. acidophilus by mouth along with most standard drug therapies helps treat stomach ulcers caused by H. pylori. A long-term disorder of the large intestines that causes stomach pain (irritable bowel syndrome or IBS). Taking L. acidophilus by mouth with other probiotics seems to reduce symptoms of IBS. Possibly ineffective for...: Prone to allergies and allergic reactions (atopic disease). Taking L. acidophilus by mouth during pregnancy, while breastfeeding, or giving it to newborns doesn't seem to prevent allergies in children. Is it safe?: When taken by mouth : L. acidophilus is likely safe. It's been used safely together with other probiotics for up to 9 months. Some people might experience gas or bloating, but it's usually well-tolerated. When applied to the vagina : L. acidophilus is likely safe. It's been used safely for up to 12 weeks. Special precautions & warnings: Pregnancy : L. acidophilus is possibly safe when taken by mouth during pregnancy. It's been used safely together with other probiotics for 6 weeks, starting at 24-28 weeks of pregnancy. Breast-feeding : There isn't enough reliable information to know if L. acidophilus is safe to use while breast-feeding. But there's no reason to expect safety concerns when used appropriately under medical supervision. Children : L. acidophilus is likely safe when taken by mouth appropriately in most children. It's been used safely alone and together with other probiotics. However, there isn't enough reliable information to know if L. acidophilus is safe for very small premature infants. Weakened immune system : Some probiotics have caused blood infections in a small number of people with weakened immune systems. If you have a weakened immune system, talk with your healthcare provider before taking probiotics, including L. acidophilus. Damaged heart valves : Some probiotics have caused infections of the inner lining of the heart chambers and heart valve. This is extremely rare, but people with damaged heart valves should stop taking probiotics like Lactobacillus acidophilus before dental procedures or surgical procedures. Are there interactions with medications?: Moderate: Be cautious with this combination. Antibiotic drugs: L. acidophilus is a type of friendly bacteria. Antibiotics are used to reduce harmful bacteria in the body. Taking antibiotics along with L. acidophilus can reduce the effects of L. acidophilus. To avoid this interaction, take L. acidophilus products at least 2 hours before or after antibiotics. Are there interactions with herbs and supplements?: There are no known interactions with herbs and supplements. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: L. acidophilus is sometimes added to fermented foods such as yogurt, but it's most commonly used in dietary supplements. In adults, L. acidophilus has most often been taken by mouth, alone or together with other probiotics, in doses of up to 60 billion CFUs daily for up to 6 months. In children, L. acidophilus has most often been taken by mouth in doses of up to 30 billion CFUs daily, for up to 3 months. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Saccharomyces boulardii",
      "link": "https://medlineplus.gov/druginfo/natural/332.html",
      "source": "MedlinePlus",
      "date": "25/06/2024",
      "content": "What is it?: Saccharomyces boulardii (S. boulardii) is a type of probiotic (\"friendly\" organism). It's a yeast that is actually a strain of Saccharomyces cerevisiae. \"Friendly\" organisms such as S. boulardii can help fight off \"bad\" organisms that might cause diseases. S. boulardii is different from other strains of S. cerevisiae, commonly known as brewer's yeast and baker's yeast. People commonly use S. boulardii for treating and preventing diarrhea, including rotaviral diarrhea in children. It's also used for other types of diarrhea, acne, a digestive tract infection that can lead to ulcers, and many other conditions, but there is no good scientific evidence to support many of its other uses. There is also no good evidence to support using S. boulardii for COVID-19. Don't confuse S. boulardii with other probiotics, or with fermented food products such as fermented milk, kefir, or yogurt. These are not the same. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for SACCHAROMYCES BOULARDII are as follows: There is interest in using S. boulardii for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Likely effective for...: Diarrhea. Taking S. boulardii by mouth can reduce how long diarrhea lasts in children. It's not clear if it helps children with longer-lasting diarrhea or if it helps adults. Possibly effective for...: Diarrhea in people taking antibiotics (antibiotic-associated diarrhea). Taking S. boulardii by mouth can help prevent diarrhea in adults and children being treated with antibiotics. Infection of the gastrointestinal tract by bacteria called Clostridioides difficile. Taking S. boulardii by mouth seems to help prevent diarrhea from C. difficile infection. Taking it along with antibiotics also seems to help prevent this infection from coming back. A digestive tract infection that can lead to ulcers (Helicobacter pylori or H. pylori). Taking S. boulardii by mouth along with standard H. pylori treatment helps prevent side effects such as diarrhea and nausea that occur with standard H. pylori treatment. But it isn't clear if taking S. boulardii helps these standard treatments to work better. A serious intestinal disease in premature infants (necrotizing enterocolitis or NEC). Most research shows that giving S. boulardii by mouth to preterm infants prevents NEC. Diarrhea caused by rotavirus. Taking S. boulardii by mouth seems to reduce how long diarrhea lasts in children with diarrhea caused by rotavirus. Travelers' diarrhea. Taking S. boulardii by mouth seems to reduce the risk of developing diarrhea while traveling. Possibly ineffective for...: Blood infection (sepsis). Giving S. boulardii to preterm infants by mouth does not prevent sepsis. Is it safe?: When taken by mouth : S. boulardii is likely safe when used for up to 15 months. It can cause gas in some people. Special precautions & warnings: Pregnancy and breast-feeding : There isn't enough reliable information to know if S. boulardii is safe to use when pregnant or breast-feeding. Stay on the safe side and avoid use. Children : S. boulardii is possibly safe for most children when taken by mouth appropriately. But diarrhea in children should be evaluated by a healthcare professional before using S. boulardii. There isn't enough reliable information to know if S. boulardii is safe for very small premature infants. Elderly : Older adults might have an increased risk of fungal infection when taking S. boulardii. Stay on the safe side and avoid use. Digestive tract disease : S. boulardii has caused fungal infections in people with diseases of the digestive tract. If you have a digestive tract disease, talk with your healthcare provider before taking S. boulardii. Weakened immune system : S. boulardii has caused fungal infections in people with weakened immune systems. In many cases, the infection was due to a catheter becoming contaminated. If you have a weakened immune system, talk with your healthcare provider before taking S. boulardii. Yeast allergy : People with yeast allergy can be allergic to products containing S. boulardii. Stay on the safe side and avoid these products. Are there interactions with medications?: Minor: Be watchful with this combination. Medications for fungal infections (Antifungals): S. boulardii is a fungus. Medications for fungal infections help reduce fungus in and on the body. Taking S. boulardii with medications for fungal infections can reduce the effects of S. boulardii. Are there interactions with herbs and supplements?: There are no known interactions with herbs and supplements. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: In adults, S. boulardii has most often been taken by mouth in doses of 500-1000 mg (about 10-20 billion colony-forming units) daily for 4 weeks. In children, S. boulardii has most often been taken by mouth in doses of 250-500 mg (about 5-10 billion colony-forming units) for up to 4 weeks. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Quercetin",
      "link": "https://medlineplus.gov/druginfo/natural/294.html",
      "source": "MedlinePlus",
      "date": "29/10/2024",
      "content": "What is it?: Quercetin is a plant pigment (flavonoid). It's found in many plants and foods, such as red wine, onions, green tea, apples, and berries. Quercetin has antioxidant and anti-inflammatory effects that might help reduce swelling, kill cancer cells, control blood sugar, and help prevent heart disease. Quercetin is most commonly used for conditions of the heart and blood vessels and to prevent cancer. It is also used for arthritis, bladder infections, and diabetes, but there is no strong scientific evidence to support most of these uses. There is also no good evidence to support using quercetin for COVID-19. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for QUERCETIN are as follows: There is interest in using quercetin for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly ineffective for...: Athletic performance. Taking quercetin by mouth before exercise doesn't decrease fatigue or improve exercise ability. Is it safe?: When taken by mouth : Quercetin is possibly safe for most people when used short-term. Quercetin has been safely used in doses up to 1 gram daily for 12 weeks. It's not known if long-term use or higher doses are safe. When applied to the skin : There isn't enough reliable information to know if quercetin is safe or what the side effects might be. Special precautions & warnings: Pregnancy and breast-feeding : There isn't enough reliable information to know if quercetin is safe to use when pregnant or breast-feeding. Stay on the safe side and avoid use. Kidney problems : Quercetin might make kidney problems worse. Don't use quercetin if you have kidney problems. Are there interactions with medications?: Moderate: Be cautious with this combination. Antibiotics (Quinolone antibiotics): Some scientists think that taking quercetin along with certain antibiotics, called quinolone antibiotics, might decrease the effects of these antibiotics. But it's too soon to know if this is a big concern. Cyclosporine (Neoral, Sandimmune): Quercetin might decrease how quickly the body breaks down cyclosporine. Taking quercetin with cyclosporine might increase the effects and side effects of cyclosporine. Diclofenac (Voltaren, others): Quercetin might decrease how quickly the body breaks down diclofenac. Taking quercetin with diclofenac might increase the effects and side effects of diclofenac. Losartan (Cozaar): Quercetin might change how the body absorbs and breaks down losartan. Taking quercetin with losartan might change the effects and side effects of losartan. Medications changed by the liver (Cytochrome P450 2C8 (CYP2C8) substrates): Some medications are changed and broken down by the liver. Quercetin might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 2C9 (CYP2C9) substrates): Some medications are changed and broken down by the liver. Quercetin might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 2D6 (CYP2D6) substrates): Some medications are changed and broken down by the liver. Quercetin might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 3A4 (CYP3A4) substrates): Some medications are changed and broken down by the liver. Quercetin might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications for diabetes (Antidiabetes drugs): Quercetin might lower blood sugar levels. Taking quercetin along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Medications for high blood pressure (Antihypertensive drugs): Quercetin might lower blood pressure. Taking quercetin along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications moved by pumps in cells (Organic Anion Transporter 1 (OAT1) Substrates): Some medications are moved in and out of cells by pumps. Quercetin might change how these pumps work and change how much medication stays in the body. In some cases, this might change the effects and side effects of a medication. Medications moved by pumps in cells (Organic Anion Transporter 3 (OAT3) Substrates): Some medications are moved in and out of cells by pumps. Quercetin might change how these pumps work and change how much medication stays in the body. In some cases, this might change the effects and side effects of a medication. Medications moved by pumps in cells (Organic anion-transporting polypeptide substrates): Some medications are moved in and out of cells by pumps. Quercetin might change how these pumps work and change how much medication stays in the body. In some cases, this might change the effects and side effects of a medication. Medications moved by pumps in cells (P-glycoprotein substrates): Some medications are moved in and out of cells by pumps. Quercetin might change how these pumps work and change how much medication stays in the body. In some cases, this might change the effects and side effects of a medication. Midazolam (Versed): Quercetin might increase how quickly the body breaks down midazolam. Taking quercetin with midazolam might reduce the effects of midazolam. Mitoxantrone: Quercetin might increase levels of mitoxantrone. Taking quercetin and mitoxantrone together might increase the effects and side effects of mitoxantrone. Pravastatin (Pravachol): Quercetin might decrease how quickly the body gets rid of pravastatin. Taking quercetin with pravastatin might increase the effects and side effects of pravastatin. Prazosin (Minipress): Quercetin might increase levels of prazosin. Taking quercetin and prazosin together might increase the effects and side effects of prazosin. Quetiapine (Seroquel): Quercetin might increase levels of quetiapine. Taking quercetin and quetiapine together might increase the effects and side effects of quetiapine. Sulfasalazine (Azulfidine): Quercetin might increase levels of sulfasalazine. Taking quercetin and sulfasalazine together might increase the effects and side effects of sulfasalazine. Warfarin (Coumadin): Quercetin might increase the effects that warfarin has on the body. Taking quercetin and warfarin together might increase the effects and side effects of warfarin, which could increase the risk of bruising and bleeding. Are there interactions with herbs and supplements?: Herbs and supplements that might lower blood pressure: Quercetin might lower blood pressure. Taking it with other supplements that have the same effect might cause blood pressure to drop too much. Examples of supplements with this effect include andrographis, casein peptides, L-arginine, niacin, and stinging nettle. Herbs and supplements that might lower blood sugar: Quercetin might lower blood sugar. Taking it with other supplements with similar effects might lower blood sugar too much. Examples of supplements with this effect include aloe, bitter melon, cassia cinnamon, chromium, and prickly pear cactus. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Quercetin has most often been used by adults in doses of 250-1000 mg by mouth daily for up to 12 weeks. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Lutein",
      "link": "https://medlineplus.gov/druginfo/natural/754.html",
      "source": "MedlinePlus",
      "date": "29/01/2025",
      "content": "What is it?: Lutein is a type of organic pigment called a carotenoid. It is related to beta-carotene and vitamin A. Many people think of lutein as \"the eye vitamin.\" Lutein is one of two major carotenoids found in the human eye (macula and retina). It is thought to function as a light filter, protecting the eye tissues from sunlight damage. Foods rich in lutein include egg yolks, spinach, kale, corn, orange pepper, kiwi fruit, grapes, zucchini, and squash. Lutein is commonly taken by mouth to prevent eye diseases, including cataracts and a disease that leads to vision loss in older adults (age-related macular degeneration or AMD). Lutein is used for many other conditions, but there is no good scientific evidence to support these other uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for LUTEIN are as follows: There is interest in using lutein for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: An eye disease that leads to vision loss in older adults (age-related macular degeneration or AMD). Taking lutein supplements by mouth for up to 36 months can improve some symptoms of AMD. More benefits might be seen when it's taken for at least 3 months at doses above 5 mg, and when it's combined with other carotenoid vitamins. But lutein doesn't seem to keep AMD from becoming worse over time. Cataracts. Eating higher amounts of lutein in the diet is linked with a lower risk of developing cataracts. But it's not clear if taking lutein supplements by mouth helps people who already have cataracts. Possibly ineffective for...: A lung disease that affects newborns (bronchopulmonary dysplasia). Giving preterm infants lutein and zeaxanthin by mouth doesn't reduce the chance of developing bronchopulmonary dysplasia. A serious intestinal disease in premature infants (necrotizing enterocolitis or NEC). Giving preterm infants lutein and zeaxanthin by mouth doesn't prevent NEC. An inherited eye condition that causes poor night vision and loss of side vision (retinitis pigmentosa). Taking lutein by mouth doesn't improve vision or other symptoms in people with retinitis pigmentosa. An eye disorder in premature infants that can lead to blindness (retinopathy of prematurity). Giving preterm infants lutein and zeaxanthin by mouth doesn't prevent retinopathy of prematurity. Is it safe?: When taken by mouth : Lutein is likely safe when taken by mouth. Consuming up to 20 mg of lutein daily as part of the diet or as a supplement appears to be safe. Special precautions & warnings: Pregnancy and breast-feeding : Lutein is likely safe when used in the amounts found in food. Children : Lutein is likely safe when taken by mouth in appropriate amounts. A specific product (LUTEINofta, SOOFT Italia SpA) containing lutein 0.14 mg daily has been safely used in infants for 36 weeks. Are there interactions with medications?: It is not known if this product interacts with any medicines.Before taking this product, talk with your health professional if you take any medications. Are there interactions with herbs and supplements?: Beta-carotene: Using beta-carotene along with lutein may reduce the amount of lutein or beta-carotene that the body can absorb. Vitamin E: Taking lutein supplements might decrease how much vitamin E the body absorbs. Taking lutein and vitamin E together might decrease the effects of vitamin E. Are there interactions with foods?: Lutein is better absorbed by the body when it is taken with a high-fat meal. How is it typically used?: Lutein is found in many foods, including egg yolks, spinach, kale, corn, orange pepper, kiwi fruit, grapes, zucchini, and squash. There's 44 mg of lutein in one cup of cooked kale, 26 mg per cup of cooked spinach, and 3 mg per cup of broccoli. Lutein is also taken in supplements. It's most often been used by adults in doses of 10-20 mg by mouth daily, for up to 3 years. Many multivitamins contain lutein. They usually provide a relatively small amount, such as 0.25 mg per tablet. Lutein is absorbed best when it's taken with a high-fat meal. Speak with a healthcare provider to find out what type of product or dose might be best for a specific condition."
    },
    {
      "title": "Lycopene",
      "link": "https://medlineplus.gov/druginfo/natural/554.html",
      "source": "MedlinePlus",
      "date": "30/01/2023",
      "content": "What is it?: Lycopene is a type of organic pigment called a carotenoid. It is related to beta-carotene and gives some vegetables and fruits (e.g., tomatoes) a red color. Lycopene is a powerful antioxidant that might help protect cells from damage. It's found in tomato, watermelon, red orange, pink grapefruit, apricot, rose hip, and guava. Lycopene is used for high blood pressure, high cholesterol, cancer, and many other conditions, but there is no good scientific evidence to support most of these uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for LYCOPENE are as follows: There is interest in using lycopene for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Prostate cancer. Taking lycopene by mouth might slightly reduce the risk of developing prostate cancer. It might also slightly reduce the risk of prostate cancer returning. Possibly ineffective for...: Bladder cancer. People who eat more lycopene in their diet don't seem to have a lower risk for bladder cancer. Diabetes. People who eat more lycopene in their diet don't seem to have a lower risk of developing diabetes. Also, people with diabetes who eat more lycopene don't seem to have a lower risk of dying from heart disease. Is it safe?: When taken by mouth : Lycopene is commonly consumed in certain fruits and vegetables. When taken in supplements, doses of 15-45 mg daily have been safely used for up to 6 months. Special precautions & warnings: Pregnancy and breast-feeding : Lycopene is likely safe during pregnancy and breast-feeding when eaten in typical food amounts. There isn't enough reliable information to know if lycopene supplements are safe to use when pregnant or breast-feeding. Stay on the safe side and stick to food amounts. Surgery : Lycopene might slow blood clotting. It might increase the risk of bleeding during and after surgery. Stop using lycopene supplements at least 2 weeks before a scheduled surgery. Are there interactions with medications?: Moderate: Be cautious with this combination. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): Lycopene might slow blood clotting. Taking lycopene along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Are there interactions with herbs and supplements?: Beta-carotene: Taking beta-carotene along with lycopene may alter the amount of lycopene that is absorbed from the gut. Calcium: Taking calcium along with lycopene may decrease the amount of lycopene that is absorbed from the gut. Herbs and supplements that might slow blood clotting: Lycopene might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Lutein: Taking lutein along with lycopene may alter the amount of lycopene that is absorbed from the gut. Are there interactions with foods?: Fat substitutes such as olestra might reduce the amount of lycopene that is absorbed by the body. Olestra seems to lower lycopene levels in healthy people by about 30%. How is it typically used?: Lycopene is commonly found in many fruits and vegetables, but particularly in tomato products, including fresh tomatoes, tomato sauce, ketchup, and tomato juice. A 130 gram serving of fresh tomatoes contains 4-10 mg of lycopene. Ketchup contains 3.3 mg per tablespoon. Lycopene supplements are also available. Lycopene has most often been used by adults in doses of 15-45 mg by mouth daily for up to 6 months. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Berberine",
      "link": "https://medlineplus.gov/druginfo/natural/1126.html",
      "source": "MedlinePlus",
      "date": "19/02/2025",
      "content": "What is it?: Berberine is a chemical found in some plants like European barberry, goldenseal, goldthread, Oregon grape, phellodendron, and tree turmeric. Berberine is a bitter-tasting and yellow-colored chemical. It might help strengthen the heartbeat, which could benefit people with certain heart conditions. It might also kill bacteria, help regulate how the body uses sugar in the blood, and help reduce swelling. People most commonly use berberine for diabetes, high levels of cholesterol or other fats in the blood, and high blood pressure. It is also used for burns, canker sores, liver disease, and many other conditions but there is no good scientific evidence to support many of these uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for BERBERINE are as follows: There is interest in using berberine for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Canker sores. Applying a gel containing berberine can reduce pain, redness, oozing, and the size of canker sores. Diabetes. Taking berberine by mouth seems to slightly reduce blood sugar levels in people with diabetes. A digestive tract infection that can lead to ulcers (Helicobacter pylori or H. pylori). Adding berberine by mouth to multiple medications that are typically used to treat this condition might work as well as other accepted treatments for this condition. These other treatments also use multiple medications. High levels of cholesterol or other fats (lipids) in the blood (hyperlipidemia). Taking berberine by mouth, alone or with other ingredients, might help lower total cholesterol, low-density lipoprotein (LDL or \"bad\") cholesterol, and triglyceride levels in people with high cholesterol. High blood pressure. Taking 0.9 grams of berberine by mouth daily along with the blood pressure-lowering drug amlodipine reduces blood pressure better than taking amlodipine alone in people with high blood pressure. A hormonal disorder that causes enlarged ovaries with cysts (polycystic ovary syndrome or PCOS). Taking berberine by mouth might lower blood sugar, improve cholesterol and triglyceride levels, reduce testosterone levels, and lower waist-to-hip ratio in people with PCOS. Is it safe?: When taken by mouth : Berberine is possibly safe for most adults. It's been used safely in doses up to 1.5 grams daily for 6 months. Common side effects include diarrhea, constipation, gas, and upset stomach. When applied to the skin : Berberine is possibly safe for most adults when used short-term. Special precautions & warnings: Pregnancy : It's likely unsafe to take berberine by mouth if you are pregnant. Berberine can cross the placenta and might cause harm to the fetus. Kernicterus, a type of brain damage, has developed in newborn infants exposed to berberine. Breast-feeding : It's likely unsafe to take berberine if you are breast-feeding. Berberine can be transferred to the infant through breast milk, and it might cause harm. Children : It's likely unsafe to give berberine to newborns. It can cause kernicterus, a rare type of brain damage that can occur in newborns who have severe jaundice. There isn't enough reliable information to know if berberine is safe in older children. High bilirubin levels in the blood in infants : Bilirubin is a chemical that is produced when old red blood cells break down. It is normally removed by the liver. Berberine may keep the liver from removing bilirubin fast enough. This can cause brain problems, especially in infants with high levels of bilirubin in the blood. Avoid using. Are there interactions with medications?: Major: Do not take this combination. Cyclosporine (Neoral, Sandimmune): Berberine might decrease how quickly the body breaks down cyclosporine. This might increase the effects and side effects of cyclosporine. Moderate: Be cautious with this combination. Dextromethorphan (Robitussin DM, others): Berberine might decrease how quickly the body breaks down dextromethorphan. This might increase the effects and side effects of dextromethorphan. Losartan (Cozaar): The liver activates losartan to make it work. Berberine might decrease how quickly the body activates it, which might decrease the effects of losartan. Medications changed by the liver (Cytochrome P450 2C9 (CYP2C9) substrates): Some medications are changed and broken down by the liver. Berberine might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 2D6 (CYP2D6) substrates): Some medications are changed and broken down by the liver. Berberine might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 3A4 (CYP3A4) substrates): Some medications are changed and broken down by the liver. Berberine might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications for diabetes (Antidiabetes drugs): Berberine might lower blood sugar levels. Taking berberine along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Medications for high blood pressure (Antihypertensive drugs): Berberine might lower blood pressure. Taking berberine along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): Berberine might slow blood clotting. Taking berberine along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Metformin (Glucophage): Berberine might increase the amount of metformin in the body. This may increase its effects and side effects. This interaction seems to occur when berberine is taken around 2 hours before metformin. Taking berberine and metformin at the same time doesn't appear to increase the amount of metformin in the body. Midazolam (Versed): The body breaks down midazolam to get rid of it. Berberine can decrease how quickly the body breaks it down. This might increase the effects and side effects of midazolam. Pentobarbital (Nembutal): Pentobarbital is a medication that can cause sleepiness. Berberine might also cause sleepiness and drowsiness. Taking berberine with pentobarbital might cause too much sleepiness. Sedative medications (CNS depressants): Berberine might cause sleepiness and slowed breathing. Some medications, called sedatives, can also cause sleepiness and slowed breathing. Taking berberine with sedative medications might cause breathing problems and/or too much sleepiness. Tacrolimus (Prograf): Tacrolimus is removed from the body by the liver. Berberine might slow down the body's ability to remove tacrolimus. This might increase the effects and side effects of tacrolimus. Are there interactions with herbs and supplements?: Cannabidiol (CBD): Taking berberine and CBD together might cause heart rhythm problems at high doses. CBD might also slow down the body's ability to remove berberine. This might increase the effects and side effects of berberine. Herbs and supplements that might lower blood pressure: Berberine might lower blood pressure. Taking it with other supplements that have the same effect might cause blood pressure to drop too much. Examples of supplements with this effect include andrographis, casein peptides, L-arginine, niacin, and stinging nettle. Herbs and supplements that might lower blood sugar: Berberine might lower blood sugar. Taking it with other supplements with similar effects might lower blood sugar too much. Examples of supplements with this effect include aloe, bitter melon, cassia cinnamon, chromium, and prickly pear cactus. Herbs and supplements that might slow blood clotting: Berberine might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Herbs and supplements with sedative properties: Berberine might cause sleepiness and slowed breathing. Taking it along with other supplements with similar effects might cause too much sleepiness and/or slowed breathing in some people. Examples of supplements with this effect include hops, kava, L-tryptophan, melatonin, and valerian. Probiotics: Probiotics are living organisms. Berberine might kill certain probiotics. If taken together, berberine might reduce how well probiotic supplements work. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Berberine has most often been used by adults in doses of 0.4-1.5 grams by mouth daily for up to 2 years. Berberine has also been used in eye drops and gels. Speak with a healthcare provider to find out what type of product and dose might be best for a specific condition."
    },
    {
      "title": "Alpha-Lipoic Acid",
      "link": "https://medlineplus.gov/druginfo/natural/767.html",
      "source": "MedlinePlus",
      "date": "04/12/2024",
      "content": "What is it?: Alpha-lipoic acid is an antioxidant that is made naturally in the body and also found in foods. It is used to break down carbohydrates and to make energy. Alpha-lipoic acid can be eaten in foods, such as red meat, carrots, beets, spinach, broccoli, and potatoes. It is also available in supplements. Because alpha-lipoic acid seems to work like an antioxidant, it might provide protection to the brain and also be helpful in certain liver diseases. People most commonly use alpha-lipoic acid for nerve pain in people with diabetes. It is also used for obesity, altitude sickness, aging skin, high levels of cholesterol or other fats in the blood, and many other purposes, but there is no good scientific evidence to support many of these other uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for ALPHA-LIPOIC ACID are as follows: There is interest in using alpha-lipoic acid for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Nerve pain in people with diabetes (diabetic neuropathy). Taking 600-1800 mg of alpha-lipoic acid by mouth or by IV seems to improve symptoms such as burning, pain, and numbness in the legs and arms of people with diabetes. Lower doses of alpha-lipoic acid don't seem to work. IV products can only be given by a healthcare provider. High levels of cholesterol or other fats (lipids) in the blood (hyperlipidemia). Taking alpha-lipoic acid by mouth for up to 4 years seems to lower total cholesterol and low-density lipoprotein (LDL or \"bad\") cholesterol in people with or without hyperlipidemia. Obesity. Taking alpha-lipoic acid by mouth can slightly reduce body weight in adults who are overweight. Possibly ineffective for...: Liver disease in people who drink alcohol. Taking alpha-lipoic acid by mouth daily for up to 6 months does not improve liver function or reduce liver damage in people with alcohol-related liver disease. Altitude sickness. Taking alpha-lipoic acid by mouth along with vitamin C and vitamin E does not seem to prevent altitude sickness. Kidney damage caused by contrast dyes (contrast induced nephropathy). Taking alpha-lipoic acid by mouth with or without standard hydration therapy during a coronary angiography doesn't seem to prevent kidney damage caused by contrast agents. Diabetes. Taking alpha-lipoic acid by mouth or by IV does not improve blood sugar levels in people with type 2 diabetes. Vision problems in people with diabetes (diabetic retinopathy). Taking alpha-lipoic acid by mouth daily for 24 months doesn't improve eye damage from diabetes. Dementia in people with advanced HIV/AIDS. Taking alpha-lipoic acid by mouth has no effect on thinking problems in people with HIV. High levels of fats called triglycerides in the blood (hypertriglyceridemia). Taking alpha-lipoic acid by mouth doesn't seem to reduce triglyceride levels in most people. Is it safe?: When taken by mouth : Alpha-lipoic acid is possibly safe for most adults when taken for up to 4 years. It is usually well-tolerated. The most common side effects are headache, heartburn, nausea, and vomiting. When applied to the skin : Alpha-lipoic acid is possibly safe for most adults when used as a cream for up to 12 weeks. It might cause a rash in some people. Special precautions & warnings: Pregnancy : When taken by mouth, alpha-lipoic acid is possibly safe. It's been used safely during pregnancy in doses of up to 600 mg daily for up to 4 weeks. Breast-feeding : There isn't enough reliable information to know if alpha-lipoic acid is safe to use when breast-feeding. Stay on the safe side and avoid use. Children : Alpha-lipoic acid is possibly safe in children aged 10-17 years when taken by mouth in doses up to 600 mg daily for 3 months. But it is possibly unsafe for children to take large amounts of alpha-lipoic acid by mouth. Seizures, vomiting, and unconsciousness have been reported for children aged 14 months to 16 years who took up to 2400 mg of alpha-lipoic acid as a single dose. Surgery : Alpha-lipoic acid can decrease blood sugar levels. Alpha-lipoic acid might interfere with blood sugar control during and after surgery. Stop taking alpha-lipoic acid 2 weeks before elective surgical procedures. Excessive use of alcohol/thiamine deficiency : Alcohol can lower the amount of thiamine (vitamin B1) in the body. Taking alpha-lipoic acid when there is a shortage of thiamine might cause serious health problems. If you drink a lot of alcohol and take alpha-lipoic acid, you should take a thiamine supplement. Are there interactions with medications?: Moderate: Be cautious with this combination. Medications for cancer (Alkylating Agents): Alpha-lipoic acid is an antioxidant. There is some concern that antioxidants might decrease the effects of some medications used for cancer. If you are taking medications for cancer, check with your healthcare provider before taking alpha-lipoic acid. Medications for cancer (Antitumor antibiotics): Alpha-lipoic acid is an antioxidant. There is some concern that antioxidants might decrease the effects of medications used for cancer. If you are taking medications for cancer, check with your healthcare provider before taking alpha-lipoic acid. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): Alpha-lipoic acid might slow blood clotting. Taking alpha-lipoic acid along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Thyroid hormone: Alpha-lipoic acid seems to decrease how well thyroid hormone works in the body. Taking alpha-lipoic acid with thyroid hormone might decrease the effects of the thyroid hormone. Minor: Be watchful with this combination. Medications for diabetes (Antidiabetes drugs): Alpha-lipoic acid might lower blood sugar levels. Taking alpha-lipoic acid along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Are there interactions with herbs and supplements?: Herbs and supplements that might lower blood sugar: Alpha-lipoic acid might lower blood sugar. Taking it with other supplements with similar effects might lower blood sugar too much. Examples of supplements with this effect include aloe, bitter melon, cassia cinnamon, chromium, and prickly pear cactus. Herbs and supplements that might slow blood clotting: Alpha-lipoic acid might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Herbs with thyroid activity: Alpha lipoic acid might affect the body's production of thyroid hormone. Taking it with other supplements with similar effects might alter thyroid function too much and cause side effects. Examples of supplements with this effect include bugleweed, lemon balm, and tiratricol. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Alpha-lipoic acid has most often been used by adults in doses of 600-1800 mg by mouth daily for up to 6 months. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    },
    {
      "title": "Eleuthero",
      "link": "https://medlineplus.gov/druginfo/natural/985.html",
      "source": "MedlinePlus",
      "date": "09/10/2024",
      "content": "What is it?: Eleuthero (Eleutherococcus senticosus) is a woody shrub sometimes called Siberian ginseng. It is not a true ginseng. It is sometimes used as an adaptogen. Eleuthero is often considered an adaptogen. Adaptogens are a class of substances that are believed to stimulate the body's resistance to physical, environmental, and emotional stressors. Eleuthero contains many chemicals that affect the brain, immune system, and certain hormones. People use eleuthero for genital herpes, diabetes, athletic performance, memory and thinking skills, the common cold, and many other conditions, but there is no good scientific evidence to support most of these uses. Don't confuse eleuthero with other herbs called \"ginseng,\" including American Ginseng, Blue Cohosh, Canaigre, Codonopsis, Panax Ginseng, and Panax Notoginseng. These are not the same. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for ELEUTHERO are as follows: There is interest in using eleuthero for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly effective for...: Genital herpes. Taking a specific eleuthero extract (Elagen) by mouth might help reduce genital herpes outbreaks. Is it safe?: When taken by mouth : Eleuthero is likely safe when used for up to 3 months. Eleuthero is usually well-tolerated. Side effects might include diarrhea, stomach upset, and headache. There isn't enough reliable information to know if eleuthero is safe to use for longer than 3 months. Special precautions & warnings: Pregnancy and breast-feeding : There isn't enough reliable information to know if eleuthero is safe to use when pregnant or breast-feeding. Stay on the safe side and avoid use. Children : Eleuthero is possibly safe in teenagers (ages 12-17 years) when taken by mouth for up to 6 weeks. There isn't enough reliable information to know if it is safe to use long-term or in young children. Heart conditions : Eleuthero might cause a pounding heart, irregular heartbeat, or high blood pressure in people who have heart disorders. If you have a heart condition, only use eleuthero under the supervision of a healthcare provider. Hormone-sensitive conditions such as breast cancer, uterine cancer, ovarian cancer, endometriosis, or uterine fibroids : Eleuthero might act like estrogen. If you have any condition that might be made worse by exposure to estrogen, don't use eleuthero. Are there interactions with medications?: Moderate: Be cautious with this combination. Digoxin (Lanoxin): There is some concern that eleuthero might increase levels of digoxin. This could increase the effects and side effects of digoxin. If you are taking digoxin, speak with a healthcare provider before taking eleuthero. Medications changed by the liver (Cytochrome P450 1A2 (CYP1A2) substrates): Some medications are changed and broken down by the liver. Eleuthero might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 2C9 (CYP2C9) substrates): Some medications are changed and broken down by the liver. Eleuthero might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications for diabetes (Antidiabetes drugs): Eleuthero might lower blood sugar levels. Taking eleuthero along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Medications moved by pumps in cells (Organic anion-transporting polypeptide substrates): Some medications are moved in and out of cells by pumps. Eleuthero might change how these pumps work and change how much medication stays in the body. In some cases, this might change the effects and side effects of a medication. Medications moved by pumps in cells (P-glycoprotein substrates): Some medications are moved in and out of cells by pumps. Eleuthero might change how these pumps work and change how much medication stays in the body. In some cases, this might change the effects and side effects of a medication. Medications that decrease the immune system (Immunosuppressants): Eleuthero can increase the activity of the immune system. Some medications, such as those used after a transplant, decrease the activity of the immune system. Taking eleuthero along with these medications might decrease the effects of these medications. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): Eleuthero might slow blood clotting. Taking eleuthero along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Minor: Be watchful with this combination. Medications changed by the liver (Cytochrome P450 2D6 (CYP2D6) substrates): Some medications are changed and broken down by the liver. Eleuthero might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Medications changed by the liver (Cytochrome P450 3A4 (CYP3A4) substrates): Some medications are changed and broken down by the liver. Eleuthero might change how quickly the liver breaks down these medications. This could change the effects and side effects of these medications. Are there interactions with herbs and supplements?: Herbs and supplements that might lower blood sugar: Eleuthero might lower blood sugar. Taking it with other supplements with similar effects might lower blood sugar too much. Examples of supplements with this effect include aloe, bitter melon, cassia cinnamon, chromium, and prickly pear cactus. Herbs and supplements that might slow blood clotting: Eleuthero might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: There isn't enough reliable information to know what an appropriate dose of eleuthero might be. It's often used in combination with other herbs such as Andrographis and Echinacea. Keep in mind that natural products are not always necessarily safe and dosages can be important. Be sure to follow relevant directions on product labels and consult a healthcare professional before using."
    },
    {
      "title": "Reishi Mushroom",
      "link": "https://medlineplus.gov/druginfo/natural/905.html",
      "source": "MedlinePlus",
      "date": "16/08/2022",
      "content": "What is it?: Reishi mushroom (Ganoderma lucidum) is a bitter-tasting fungus with no proven health benefits. It is thought to have some effects on the immune system. Reishi mushroom is used for Alzheimer disease, cancer, diabetes, cold sores, and many other conditions, but there is no good scientific evidence to support these uses. How effective is it?: Natural Medicines Comprehensive Database rates effectiveness based on scientific evidence according to the following scale: Effective, Likely Effective, Possibly Effective, Possibly Ineffective, Likely Ineffective, Ineffective, and Insufficient Evidence to Rate. The effectiveness ratings for REISHI MUSHROOM are as follows: There is interest in using reishi mushroom for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful. Possibly ineffective for...: High levels of cholesterol or other fats (lipids) in the blood (hyperlipidemia). Taking reishi mushroom by mouth doesn't seem to lower cholesterol levels in people with diabetes or high cholesterol. Is it safe?: When taken by mouth : Reishi mushroom extract is possibly safe when used for up to one year. Powdered whole reishi mushroom is possibly safe when used for up to 16 weeks. Reishi mushroom can cause dizziness, dry mouth, itching, nausea, stomach upset, and rash. Special precautions & warnings: Pregnancy and breast-feeding : There isn't enough reliable information to know if reishi mushroom is safe to use when pregnant or breast feeding. Stay on the safe side and avoid use. Bleeding disorders : High doses of reishi mushroom might increase the risk of bleeding in some people with certain bleeding disorders. Surgery : High doses of reishi mushroom might increase the risk of bleeding in some people if used before or during surgery. Stop using reishi mushroom at least 2 weeks before a scheduled surgery. Are there interactions with medications?: Moderate: Be cautious with this combination. Medications for diabetes (Antidiabetes drugs): Reishi mushroom might lower blood sugar levels. Taking reishi mushroom along with diabetes medications might cause blood sugar to drop too low. Monitor your blood sugar closely. Medications for high blood pressure (Antihypertensive drugs): Reishi mushroom might lower blood pressure. Taking reishi mushroom along with medications that lower blood pressure might cause blood pressure to go too low. Monitor your blood pressure closely. Medications that slow blood clotting (Anticoagulant / Antiplatelet drugs): Reishi mushroom might slow blood clotting. Taking reishi mushroom along with medications that also slow blood clotting might increase the risk of bruising and bleeding. Are there interactions with herbs and supplements?: Herbs and supplements that might lower blood pressure: Reishi mushroom might lower blood pressure. Taking it with other supplements that have the same effect might cause blood pressure to drop too much. Examples of supplements with this effect include andrographis, casein peptides, L-arginine, niacin, and stinging nettle. Herbs and supplements that might lower blood sugar: Reishi mushroom might lower blood sugar. Taking it with other supplements with similar effects might lower blood sugar too much. Examples of supplements with this effect include aloe, bitter melon, cassia cinnamon, chromium, and prickly pear cactus. Herbs and supplements that might slow blood clotting: Reishi mushroom might slow blood clotting and increase the risk of bleeding. Taking it with other supplements with similar effects might increase the risk of bleeding in some people. Examples of supplements with this effect include garlic, ginger, ginkgo, nattokinase, and Panax ginseng. Are there interactions with foods?: There are no known interactions with foods. How is it typically used?: Reishi mushroom has most often been used by adults in doses of 1400-5400 mg by mouth daily, usually in divided doses. Reishi mushroom extracts have also been used in lower doses. Speak with a healthcare provider to find out what dose might be best for a specific condition."
    }
  ]
}